{
  "doc-8b78dad33a42bc7933755eccb74875d2": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260623_10:15\nJenniferMoore: Hey Li Hua! 🎉 Just wanted to say how proud I am of your progress! You've been killing it in our sessions. 💪 I’ve seen so many clients like you transform their lives through dedication and hard work. Can't wait to see what you achieve next! Keep it up! 🙌\nLiHua: Thanks a lot! Your encouragement really means a lot to me. I'm feeling great about the journey ahead! Let’s keep pushing! 💥\nJenniferMoore: Absolutely! I love that energy! Remember, every little step counts. Just keep showing up and give it your all! You’ve got this! 🌟\nLiHua: I appreciate that! I’ll definitely keep pushing through. Looking forward to our next session! 💪\nJenniferMoore: Can’t wait either! We’re going to keep making progress together. Let’s crush it! 🏋️‍♀️✨",
    "content_summary": "Time: 20260623_10:15\nJenniferMoore: Hey Li Hua! 🎉 Just wanted to say how proud I am of your progress...",
    "content_length": 771,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week25\\20260623_1015.txt",
    "metadata": {
      "id": "doc_0",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week25\\20260623_1015.txt"
    },
    "created_at": "2025-09-01T16:59:30.745656",
    "updated_at": "2025-09-01T16:59:31.557767"
  },
  "doc-68b13480ea1b74f8768581cae0d17cbc": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260805_16:00\nLiHua: Hey man! Just a quick reminder that we are going to the photography exhibition at 19:00 tonight!\nWolfgangSchulz: Of course, not gonna forget about that!\nLiHua: Sounds good! Let’s grab a bite before the event. What do you feel like eating?\nWolfgangSchulz: How about we hit that new burger place? Heard their fries are awesome too!\nLiHua: That sounds perfect! I’ve been wanting to try it out. What time should we head there?\nWolfgangSchulz: Let's meet at 6:00, then we can make our way to the event after. Sound good?\nLiHua: Sounds like a plan! See you at 6:00! Can't wait!",
    "content_summary": "Time: 20260805_16:00\nLiHua: Hey man! Just a quick reminder that we are going to the photography exhi...",
    "content_length": 599,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week31\\20260805_1600.txt",
    "metadata": {
      "id": "doc_1",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week31\\20260805_1600.txt"
    },
    "created_at": "2025-09-01T16:59:31.608848",
    "updated_at": "2025-09-01T16:59:31.686638"
  },
  "doc-5cb5b75e5b5a346a58a1c8c2474d0a4a": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260810_18:00\nAdamSmith: Hey Li Hua! Just wanted to check if you’ve had a chance to look over the warranty and maintenance plans for the air conditioner. Let me know if you have any questions!\nLiHua: Yeah, I’ve looked it over. Seems decent overall. Got a couple of questions though. When’s a good time to chat about it?\nAdamSmith: How about after dinner? I should be free then. Just let me know what works for you!\nLiHua: Sounds good! I'll ping you around 8.\nAdamSmith: Perfect! Looking forward to it.",
    "content_summary": "Time: 20260810_18:00\nAdamSmith: Hey Li Hua! Just wanted to check if you’ve had a chance to look over...",
    "content_length": 508,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week32\\20260810_1800.txt",
    "metadata": {
      "id": "doc_2",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week32\\20260810_1800.txt"
    },
    "created_at": "2025-09-01T16:59:31.761956",
    "updated_at": "2025-09-01T16:59:31.781730"
  },
  "doc-e7e1442c7dd2de3345678c4a1be7deba": {
    "status": "processed",
    "chunks_count": 16,
    "content": "Time: 20261115_15:00\nThaneChambers: Hey guys! I just can't help saying that, oh boy, the fall of the Van der Linde gang is such an epic story arc! It really shows how trust and loyalty can break down under pressure. The way Arthur grapples with morality and the choices he makes really hit me hard. Plus, the clash between the old ways and the new world adds so much depth to their downfall. What do you all think?\nAisling: I totally agree! It's like watching the gang's ideals crumble as they face the outside world. Arthur's character development is so powerful, especially when he starts questioning Dutch's leadership. The tension within the gang and the betrayal by some key members also plays a huge role. Did anyone ever feel bad for Micah, though? I mean, he's a total jerk, but his relationship with Dutch kinda shows how toxic alliances can form. \nElara: It's hard to feel bad for Micah, but I get what you mean about the toxic loyalty. Dutch's blind trust in him really blindsided everyone. The way Micah manipulates the gang's dynamics just showcases how fragile their unity was. Honestly, it was a total betrayal when he turned on Arthur and the others. It’s a classic example of how greed and betrayal can destroy friendships and loyalty. \nIleana: Arthur’s ending really hits hard, especially when you see him trying to make amends for his past mistakes. I loved how he goes out fighting for what’s right, trying to help John and his family. It just shows that despite all the chaos, there's still hope and redemption. The contrast between his final moments and Dutch’s fading morality is striking too. I really felt the weight of his journey, especially after everything he went through with the gang. Anyone else have a favorite moment from Arthur’s storyline?\nDyllan: I think one of the best moments was when Arthur gave John the money for his family. It was like he finally found peace and purpose in all the chaos. The way he confronts his own mortality and chooses to help John was really moving. I felt so connected to his character during that part. It was almost like a redemption arc, showing that even after everything he did, he still wanted to do something good. What did you guys think of the game’s soundtrack during these emotional scenes?\nAisling: The soundtrack really elevates those moments! The subtle music during Arthur's last mission adds so much to the emotional weight. It really pulls you into his struggle and makes the choices feel even more poignant. I remember just sitting in silence afterward, processing everything that happened, especially with “Compass” playing in the background. It hits you right in the feels! Have you noticed how the music changes depending on your choices throughout the game? It reflects the mood perfectly. \nThaneChambers: Absolutely! The dynamic soundtrack is such a brilliant touch. It reacts to your decisions, making every choice feel significant. Those moments of reflection with the music playing in the background really amplify the storytelling. It's almost like the game is giving you a personal soundtrack to your journey. Isn’t it fascinating how music can deepen the emotional experience in games like this? What other games do you think have made great use of music in storytelling?\nThaneChambers: Black Myth: Wukong has an amazing soundtrack that adds to its epic storytelling! The blend of traditional Chinese instruments with modern orchestration really immerses you in the world. It feels like every battle and every exploration is highlighted by the music. Games like \"The Last of Us\" and \"God of War\" also do an incredible job with their soundtracks, making moments resonate even more. Do you guys have any other favorites that have really stood out to you in terms of music?\nHelios: The music in \"Journey\" is a whole vibe on its own! The way it evolves with your exploration perfectly captures the emotions of the game. Every time you reach a new area, the score just hits differently, making you feel that sense of wonder and nostalgia. Plus, the multiplayer aspect adds another layer to the experience, with the music syncopating with other players. Are there any other games where you felt the music complemented the gameplay so well?\nGavriel: Absolutely! \"Final Fantasy VII Remake\" has an awesome soundtrack too. They took the iconic themes and reimagined them while still keeping that nostalgic feel. The music during battles and key story moments really amps up the intensity and emotion. And I love how certain melodies trigger memories from the original game. It’s like a beautifully woven tapestry of nostalgia and innovation! Any other remakes or sequels you think nailed the music aspect?\nGavriel: I think the \"Resident Evil 2 Remake\" did an awesome job with its soundtrack! It combines atmospheric sounds with classic horror elements, which builds this intense tension as you explore the Raccoon City Police Station. The music really adds to the jump scares and overall creepy vibe of the game. It perfectly captures that survival horror essence. What about you all? Which remakes or sequels do you think have completely transformed their music?\nFionnuala: The \"Demon's Souls\" remake has some stunning music! They kept some themes from the original but enhanced them with orchestration that adds to the atmosphere. The haunting melodies perfectly complement the dark and eerie environments, making every boss encounter feel even more epic. It’s like the music pulls you deeper into that foreboding world! Any other remakes that took their soundtracks to a new level like this?\nBronwyn: I think \"The Legend of Zelda: Skyward Sword HD\" did a great job with the music! They gave the soundtrack a fresh sound while preserving the iconic themes we all know and love. The orchestral arrangements really breathe new life into the game, enhancing the sense of adventure and emotion throughout the journey. It adds more depth to the iconic story and environments! Are there any other remastered games that have similarly reimagined their soundtracks like this?\nFionnuala: The \"Mass Effect Legendary Edition\" is another great example! The remastered soundtrack really enhances the emotional depth and epic moments of the story. The way the music ramps up during key decisions or battles makes the stakes feel even higher. Plus, hearing all those classic themes reimagined just reignites that love for the series. It’s like getting a nostalgic rush while enjoying a modernized experience. Any other games where you felt the music just made the experience unforgettable?\nAisling: I really think \"Ghost of Tsushima\" nailed it with its soundtrack! The combination of traditional Japanese music with sweeping orchestral pieces deepened the immersion into the beautifully crafted world. The way the music swells during key moments made battles feel intense and emotional. It really amplified the whole samurai journey vibe! Any other recent games you think did such a phenomenal job with their soundtracks?\nFionnuala: \"Final Fantasy XVI\" has been amazing in that regard too! The music perfectly mixes orchestral and modern elements, capturing the epic battles and emotional character moments. The themes really enhance the lore and fantasy elements, making you feel completely immersed in its world. Plus, those boss battle themes really get your adrenaline pumping! What do you all think of how music can elevate the storytelling in games like this?\nIleana: I totally agree! Music has this incredible ability to evoke emotions and enhance the overall experience in games. When you hear that perfect track during a climactic moment, it just sticks with you, making it memorable. It’s like an emotional support that ties everything together. Games like \"Nier: Automata\" also nail that, with their hauntingly beautiful score that complements the story’s themes of existence and purpose. Any other games that you feel had a profound impact through their music?\nThaneChambers: Definitely! \"Celeste\" is one of those games where the music elevates the whole experience. Each track reflects the emotional struggles of the character, Madeline, as she climbs the mountain. It really resonates during those intense moments of gameplay, making your triumphs feel even more rewarding. Plus, the soundtrack is so uplifting – it’s on my playlist! Are there any other indie games out there everyone thinks has a stand-out score?\nBronwyn: \"Oxenfree\" has an incredible soundtrack too! The way the music blends with the atmospheric sounds really pulls you into the eerie, supernatural vibe of the game. Every choice feels amplified by the music, and I love how it creates this haunting sense of nostalgia. Plus, the dialogue system and the music sync perfectly, which enhances the overall experience. Are there other indie games that made use of music in a way that really stood out to you all?\nIleana: \"Spiritfarer\" is another indie gem with a beautiful soundtrack! The music captures the emotional essence of helping souls transition to the afterlife, combining soothing melodies with heartfelt themes. It perfectly fits the game's atmosphere and deep message about love and loss. Those moments when you're tending to your boat and interacting with the spirits are so impactful, thanks to the lovely score. Any other games that use music to create a strong emotional connection like this?\nFionnuala: \"Gris\" is a standout when it comes to using music to evoke emotions! The soundtrack flows seamlessly with the visuals, guiding you through the journey of healing and self-discovery. Each level has its own musical theme that reflects the emotional state of the character, making every moment feel poignant. The artistry combined with the score creates a truly memorable experience. Any other games that have that kind of emotional synergy between music and gameplay?\nBronwyn: \"Echoes of the Eye,\" the DLC for \"Outer Wilds,\" also nailed it. The way the music shifts from calm exploration to tense moments really immerses you in the mystery and the urgency of the story. It creates a haunting atmosphere that matches the visuals perfectly, making the experience all the more gripping. Have you guys played that? What did you think about how they used the soundtrack to enhance the narrative?\nJareth: \"Inside\" is another one that stands out for me. The minimalistic score really heightens the eerie atmosphere and builds suspense throughout the game. It feels like the music pulls you deeper into the dark narrative, making every moment feel intense and purposeful. The combination of sound design and the score creates a haunting experience that sticks with you. What other games do you feel directly connect music and atmosphere?\nFionnuala: I really think \"Hollow Knight\" deserves a shout! The music complements the game's atmosphere so well, from the haunting melodies in the Forgotten Crossroads to the intense themes during boss fights. It enhances the overall exploration and adds depth to the rich lore without overpowering the experience. The soundtrack has its own beauty that leaves a lasting impression. Any other games where you felt the music was crucial to the atmosphere?\nFionnuala: The \"Last Guardian\" has an emotional soundtrack that beautifully complements the bond between the boy and Trico. The music perfectly captures the awe and mystery of the world, accentuating those touching moments and the sense of adventure. Plus, the subtle scores during challenges keep you on edge without detracting from the visuals. Are there other games that perfectly intertwine music with emotional storytelling like this?\nThaneChambers: Totally! \"Beyond: Two Souls\" had some powerful music choices that really matched the emotional beats of the story. The whole experience felt cinematic, with the soundtrack amplifying the character's struggles and connections throughout. It made even the dialogue feel more impactful. Any other games that you think evoke similar emotions with the music?\nLiHua: The music in \"Life is Strange\" is also a highlight! It adds so much emotion to the storyline, especially during those pivotal moments. The indie tracks fit perfectly with the scenes and amplify the choices you make. It's like a character in itself! What are some other games where you felt the music really shaped your experience?\nJareth: \"Firewatch\" uses its soundtrack to create an immersive experience, with emotional beats that match the tranquil yet tense moments of exploration. The music enhances the interactions between Henry and Delilah, making their evolving relationship feel even more intimate. It’s such a beautiful narrative experience heightened by the soundtrack! Any other titles where you felt the score was essential to the storytelling?\nElara: \"Return of the Obra Dinn\" has a really unique approach to its soundtrack, using sound design that reflects the game's time and atmosphere. The eerie minimalism works so well with the mystery elements, and it makes each revelation feel profound. It’s all about that immersive experience! What other games do you all think effectively use sound to enhance storytelling?\nJareth: \"Subnautica\" does an amazing job with its underwater sound design and music! The ambient sounds draw you into the deep ocean, and the score changes based on your location, creating an atmospheric experience. It heightens the sense of exploration and even the feelings of isolation. The combination of the soundscape and visuals keeps you engaged and on edge. Any other games that you think capture a similar engrossing atmosphere through music and sound?\nFionnuala: The “Resident Evil 7” really nailed that suspenseful atmosphere! The sound design and music create a sense of dread and tension that keeps you on edge throughout. Each creak and moan in the environment, paired with the chilling score, heightens the horror experience. It's like you're constantly anticipating something terrifying around the corner. Any other survival horror games you think achieve that intense atmosphere through sound?\nFionnuala: \"Silent Hill 2\" is often considered a masterclass in sound design! The unsettling soundscapes and chilling music perfectly encapsulate the game's haunting atmosphere. It really draws you into the protagonist's psyche and amplifies the sense of dread. The way the music shifts between moments of calm and anxiety is so effective and memorable. What do you all think? Are there other games where you felt the sound design really shaped the horror experience?\nThaneChambers: Absolutely! \"Amnesia: The Dark Descent\" is another one that really capitalizes on sound to create horror. The ambient noises and creeping score build an atmosphere of tension and fear, especially when you're wandering through dark, creepy environments. You genuinely feel the dread of not knowing what's lurking around the corner. It's amazing how sound can elevate the horror experience! What other titles do you think have made an impact with sound design?\nAisling: I think \"Dead Space\" has an incredible sound design that adds to the horror! The unsettling ambient sounds, coupled with the creepy score, really heighten the tension as you navigate the eerie spaceship. The way sound cues are used to signal danger makes every creak and whisper terrifying. It definitely immerses you in that horrifying atmosphere!",
    "content_summary": "Time: 20261115_15:00\nThaneChambers: Hey guys! I just can't help saying that, oh boy, the fall of the...",
    "content_length": 15316,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week45\\20261115_1500.txt",
    "metadata": {
      "id": "doc_3",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week45\\20261115_1500.txt"
    },
    "created_at": "2025-09-01T16:59:31.886391",
    "updated_at": "2025-09-01T16:59:32.175191"
  },
  "doc-f83c2db10795f4aac1c41599adf0a127": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20261106_20:00\nJakeWatson: Hey Li Hua! 🎉 Ready to hit the field this weekend? I've set up a practice session focusing on shooting! It'll be fun, and I'll help you get the hang of it. What do you say? Let’s get some goals! ⚽️\nLiHua: Sounds like a blast! I'm in! Just let me know the time and place. Can't wait to improve my shooting skills with you! ⚽️😊\nJakeWatson: Awesome! Let’s meet at the park on Saturday at 3 PM. It’ll be great to work on some shots together! Bring your A-game! 🙌⚽️\nLiHua: Got it! I'll be there at 3 PM. Looking forward to it! Let’s score some goals! ⚽️👍\nJakeWatson: Perfect! Let’s have some fun and maybe grab some food after too. Can't wait to see you there! 🍕⚽️\nLiHua: Sounds good! I’m up for grabbing food after. It’ll be fun to chill and chat about soccer too. See you tomorrow! 🍕⚽️\nJakeWatson: Can't wait! See you tomorrow! 🙌⚽️",
    "content_summary": "Time: 20261106_20:00\nJakeWatson: Hey Li Hua! 🎉 Ready to hit the field this weekend? I've set up a pr...",
    "content_length": 861,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week44\\20261106_2000.txt",
    "metadata": {
      "id": "doc_4",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week44\\20261106_2000.txt"
    },
    "created_at": "2025-09-01T16:59:32.716790",
    "updated_at": "2025-09-01T16:59:32.751062"
  },
  "doc-25949b1be91fdd89af34675367889766": {
    "status": "processed",
    "chunks_count": 5,
    "content": "Time: 20260509_18:30\nYurikoYamamoto: Hey everyone! 😊 How about we play some gentle tunes this week? It could be a nice change of pace! What do you think? 🎶\nLiHua: That sounds like a great idea, Yuriko! I'm all in for some chill vibes. Any specific songs in mind? 🎸\nChaeSong-hwa: I'm down for that! Maybe we could do something like \"Landslide\" or \"Blackbird\" again, they're so soothing. Let me know what you all think! 🎤✨\nYurikoYamamoto: \"Landslide\" is such a beautiful choice! I love it. And \"Blackbird\" is always a winner. 🎵 Let's keep that relaxed vibe going! Any other suggestions?\nYurikoYamamoto: If anyone has some more gentle songs they like, feel free to share! The more, the merrier! 🌼\nLiHua: How about we throw in \"Sparks Fly\" too? It has such a nice feel to it! 🌞\nChaeSong-hwa: Love that suggestion! It's perfect for our gentle theme. Can't wait to sing it! 🎶😊\nWolfgangSchulz: I think we're on the right track with this gentler setlist! Just a reminder, let’s save the full rehearsals for Sunday night. Hope everyone is ready to rock! 🥁🎸\nLiHua: Totally! Looking forward to it! Let’s bring those mellow vibes! 😄🎶\nChaeSong-hwa: I’ll make sure to warm up my vocals before practice! It's gonna be great! 🎤💖\nWolfgangSchulz: Can't wait to jam together! See you all tomorrow! 🎵\nYurikoYamamoto: See you all tomorrow! This is gonna be fun! 😄🎶✨\nWolfgangSchulz: Looking forward to it! Let's enjoy some good music together! 🎉\nLiHua: So excited for band practice! Can't wait to hit those gentle tunes! 🎸🌼\nWolfgangSchulz: It's going to be a fantastic session! See you soon, everyone! 🎤✨\nLiHua: I'm ready for some chill music vibes! Let’s make it a memorable night! 🎶😊\nChaeSong-hwa: Can't wait for the jam session! It'll be a nice way to unwind and enjoy music together. See you all! 🎶💖\nWolfgangSchulz: Remember to bring your energy! It’s gonna be a great time! 🎉🥁\nYurikoYamamoto: This week is going to be so relaxing and fun! Can't wait to see everyone and play together! 😄🎵✨\nYurikoYamamoto: See you guys tomorrow! Let's make some beautiful music! 🎶🌈\nChaeSong-hwa: Can't wait to see you all and create some beautiful tunes together! It's gonna be a blast! 🎤💫\nYurikoYamamoto: Remember to bring good vibes! We're gonna have a great time! 🎉\nChaeSong-hwa: Looking forward to it! Let's all bring our best selves and enjoy the music! 🎶😊\nYurikoYamamoto: See you all soon for some great music and fun times! Let's do this! 🌟🎸\nLiHua: I'm pumped for our practice! Let’s make this session special! 🎶✨\nChaeSong-hwa: It'll be awesome! Can't wait to vibe with everyone! 🎤💖\nLiHua: Let's make it a fantastic night together! Looking forward to it, everyone! 🌙🎶\nWolfgangSchulz: Excited to rock out with all of you! It's going to be a night to remember! 🎸🥁",
    "content_summary": "Time: 20260509_18:30\nYurikoYamamoto: Hey everyone! 😊 How about we play some gentle tunes this week? ...",
    "content_length": 2733,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week18\\20260509_1830.txt",
    "metadata": {
      "id": "doc_5",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week18\\20260509_1830.txt"
    },
    "created_at": "2025-09-01T16:59:33.404874",
    "updated_at": "2025-09-01T16:59:33.465628"
  },
  "doc-a20ef9c90c581f8ce8da5881198cf498": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260718_18:00\nWolfgangSchulz: Hey man! Check out this awesome guitar I found online. A bit pricey, but I thought you might like it! 🎸 [link]\nLiHua: Wow, that looks amazing! 😍 I love the design! I'll have to save up a bit for that, but it could totally be worth it. Thanks for sharing, man!\nWolfgangSchulz: No problem! I can totally see you rocking that guitar. Let's keep jamming! 🎶\nLiHua: For sure! I can't wait for our next session. What are we playing this week? 🎤🥁\nWolfgangSchulz: Thinking we could try something new this week! Maybe something by The Beatles? 🎵 What do you think?\nLiHua: That sounds great! Maybe \"Come Together\" again? Everyone loved that last time! 🎸😊\nWolfgangSchulz: We could definitely do that! Plus, it's a fun one to play. Looking forward to it!",
    "content_summary": "Time: 20260718_18:00\nWolfgangSchulz: Hey man! Check out this awesome guitar I found online. A bit pr...",
    "content_length": 778,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week28\\20260718_1800.txt",
    "metadata": {
      "id": "doc_6",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week28\\20260718_1800.txt"
    },
    "created_at": "2025-09-01T16:59:34.237498",
    "updated_at": "2025-09-01T16:59:34.262048"
  },
  "doc-28a8002785187562062f9468957eee61": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20261007_12:00\nAdamSmith: Hey Li Hua! Just wanted to let you know that I’ve booked the curtain in the right size. It should arrive by the end of the weekend! 😊\nLiHua: That sounds great! Thanks for taking care of that. Looking forward to seeing it!\nAdamSmith: No problem! I’m glad to help. Let me know if you need anything else.\nLiHua: Will do! Hope you have a good day ahead!\nAdamSmith: Thanks! You too!",
    "content_summary": "Time: 20261007_12:00\nAdamSmith: Hey Li Hua! Just wanted to let you know that I’ve booked the curtain...",
    "content_length": 409,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week40\\20261007_1200.txt",
    "metadata": {
      "id": "doc_7",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week40\\20261007_1200.txt"
    },
    "created_at": "2025-09-01T16:59:35.100147",
    "updated_at": "2025-09-01T16:59:35.118773"
  },
  "doc-00fa03493d7030d4bc825aede0beae58": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20261209_19:00\nLiHua: Hey man! Having a good breakfast is really good for our health! What are some healthy breakfast options in your opinion?\nWolfgangSchulz: Thinking about trying some avocado toast or oatmeal. What do you think? 👀🍽️\nLiHua: Avocado toast sounds awesome! You could add some eggs on top for extra protein! 🥑🍳 What do you usually like for breakfast?\nWolfgangSchulz: I usually go for something quick, like yogurt or a smoothie. Gotta keep it easy during the week! \nLiHua: Smoothies are a great choice! You can pack them with fruits and veggies too. Do you have any favorite smoothie recipes? 🍓🥬\nWolfgangSchulz: I like mixing banana, spinach, and almond milk. It's pretty refreshing! What about you?\nLiHua: I love blending strawberries, bananas, and some yogurt for creaminess! It’s so tasty and keeps me energized. 😋🍌🍓\nWolfgangSchulz: Sounds delicious! We should probably do a healthy breakfast sesh sometime. What do you think?",
    "content_summary": "Time: 20261209_19:00\nLiHua: Hey man! Having a good breakfast is really good for our health! What are...",
    "content_length": 948,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week49\\20261209_1900.txt",
    "metadata": {
      "id": "doc_8",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week49\\20261209_1900.txt"
    },
    "created_at": "2025-09-01T16:59:36.045052",
    "updated_at": "2025-09-01T16:59:36.071088"
  },
  "doc-86b91a781aaee4aec8ceee5f086856f3": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260618_11:30\nHaileyJohnson: Hey Li Hua! I am hosting a free baking class this weekend! 🎉 Are you interested in coming?\nLiHua: Yes, for sure!\nHaileyJohnson: Great! Do you have any dietary restrictions I should keep in mind?\nLiHua: Thanks for asking! No dietary restrictions here, I'm all set. Looking forward to the class! 🍰\nHaileyJohnson: Awesome! Can’t wait to bake together! If you have any special requests for what you want to learn, just let me know. 😊\nLiHua: Sweet! I’d love to learn how to make pastries if we can. That would be great! 🥐\nHaileyJohnson: Great choice! Pastries are super fun to make. I’ll make sure to include some techniques in our class. See you soon! 💖\nLiHua: Can't wait! See you this weekend!",
    "content_summary": "Time: 20260618_11:30\nHaileyJohnson: Hey Li Hua! I am hosting a free baking class this weekend! 🎉 Are...",
    "content_length": 726,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week24\\20260618_1130.txt",
    "metadata": {
      "id": "doc_9",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week24\\20260618_1130.txt"
    },
    "created_at": "2025-09-01T16:59:37.075484",
    "updated_at": "2025-09-01T16:59:37.097588"
  },
  "doc-cb1169c5aefd74021c8e93cdf66d9221": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260617_17:00\nLiHua: Did you see the poster saying that our town is holding a local music festival? It looks like it can be an opportunity for our band to perform in front of the crowd!\nWolfgangSchulz: Wow! Sounds like a great opportunity for the band! I think we can prepare for this event! Just a reminder though, I'd prefer we keep it to Sundays for practice since my week is pretty packed. Let’s make the most of our Sunday jam sessions! What do you think?\nLiHua: Yeah, Sundays work perfectly! Maybe we can plan to meet earlier than usual to go over some new songs? I'm super excited about the local music festival coming up!\nWolfgangSchulz: I'm all in for that! Meeting earlier sounds good. We can prep some new stuff and make sure we're tight for the festival. Let's pick a song list for Sunday!\nLiHua: Absolutely! We should focus on some crowd-pleasers. How about we include \"Sweet Home Alabama\" and throw in something fresh? Maybe Yuriko can pick a bass-heavy track too! \nWolfgangSchulz: Great idea! \"Sweet Home Alabama\" is a must. And yes, let Yuriko suggest something! I’ve been eager to work on some new material. Can't wait for Sunday!\nLiHua: Let’s finalize our list before Sunday then! Should we touch base with Yuriko about her track? \nWolfgangSchulz: Yeah, let’s do that! I’ll message Yuriko to get her input. Looking forward to it!",
    "content_summary": "Time: 20260617_17:00\nLiHua: Did you see the poster saying that our town is holding a local music fes...",
    "content_length": 1354,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week24\\20260617_1700.txt",
    "metadata": {
      "id": "doc_10",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week24\\20260617_1700.txt"
    },
    "created_at": "2025-09-01T16:59:38.233703",
    "updated_at": "2025-09-01T16:59:38.265932"
  },
  "doc-c283e17589a754bb347cf3e7bd8b857d": {
    "status": "processed",
    "chunks_count": 11,
    "content": "Time: 20260428_17:00\nSage: Hey everyone! So, I've been focusing on my breathing while squatting lately, and I feel like it’s tricky sometimes. I usually hold my breath when I’m going down, but it makes me feel a bit dizzy. What’s the best way to keep it steady? Any tips?\nPhoenix: Breathing during squats is super important! Try to inhale as you go down and exhale when you come up. This helps keep you stable and can make the lift feel easier. Also, don't forget to engage your core for better support! Do you feel that helps you maintain form?\nViper: Yeah, that definitely makes sense! I’ve been focusing on my core too but sometimes I still feel a bit off balance. Maybe if I practice the breathing in a more controlled way, it’ll help. Has anyone else felt dizzy when focusing too much on that?\nSage: For sure! I felt that too when I first started. I found that slowing down the movements helped a lot. Also, make sure you’re not overexerting yourself – it’s all about finding that sweet spot. What works for you when you're struggling to keep balance?\nLiHua: Just take your time with each squat and focus on the rhythm of your breathing. It really helps to avoid rushing through the reps. Finding a consistent pattern while squatting can also make a big difference! Have you tried visualizing the movement?\nJenniferMoore: Yeah, definitely visualize the movement! That helps a lot with form and keeping your mind focused. Another tip is to choose a pace that feels comfortable and stick with it. Practice makes perfect, so don’t stress too much! Let’s keep working on it together! 💪\nOmen: I've been thinking about something related to this too. When I'm squatting, I often feel a tightness in my chest if I'm not breathing right. It's like I'm holding on too tight! Anyone else experience that? How did you address it?\nJett: I know that feeling! It’s like your body’s trying to give you a signal. What helped me was really focusing on relaxing my upper body while squatting. Sometimes just reminding myself to breathe through the movement made a huge difference. Have you tried doing some deep breathing exercises before lifting?\nJenniferMoore: That’s a great suggestion! Deep breathing can really help relax those tight muscles and get you in the right headspace. It also sets the tone for those heavier lifts. Maybe we can incorporate a warm-up routine focusing on that before our next session?\nLiHua: Absolutely! Adding in a warm-up focused on breathing and relaxation sounds perfect. It’ll prepare us better and help with the overall squatting experience. Consistency is key! Looking forward to trying this out!\nCypher: I’m curious about how y’all handle any discomfort during squats. Sometimes I struggle with a bit of knee strain. What techniques do you use to prevent or minimize that feeling during your workouts?\nJett: When I feel discomfort in my knees, I focus on my form and make sure my knees are tracking over my toes. Warming up those joints beforehand really helps too! Have you tried adjusting your foot positioning or using weights that allow you to maintain control?\nCypher: Yes! Adjusting foot positioning has really helped me—inching my feet out wider gave me better stability. I also like incorporating some mobility drills for my hips and knees before I squat. It’s made such a difference! What about you? Have you found any specific drills helpful?\nOmen: I’ve been adding some dynamic stretches to my routine. It really warms up the muscles and limits strain. Also, my coach suggested doing some glute activation exercises before squats—they've been a game changer! Have you all tried any glute activation exercises?\nSova: Yeah, glute activation is definitely key! I’ve been doing bridges and clamshells before squats, and it makes such a difference in my performance. I can really feel a stronger push from my hips. What exercises do you usually do for warming up?\nSage: I stick to clamshells and monster walks; they feel great for activating my glutes! Plus, a few leg swings and some deep squats just to loosen everything up. It really primes the muscles for what’s ahead. Which ones have you all seen the most benefits from?\nRaze: I also love doing leg swings and deep squats! They really help in getting the blood flowing. Plus, I’ve been incorporating some dynamic lunges too—it feels like a great prep for my legs. Do you feel a difference in your performance when you add those in?\nPhoenix: I totally notice a difference when I include those! Dynamic lunges really warm up my quads and glutes, making the first few sets feel solid. It helps get my muscles activated and ready for heavier weights. Have you felt more stable during your lifts after those warm-ups?\nRaze: Absolutely! That stability makes such a difference in how I navigate my sets. It's nice to start feeling stronger and more confident going into the heavier lifts. Plus, it really helps me push through those last reps! What do you all think about adding mobility work on recovery days too?\nViper: I’m all for that! Mobility work on recovery days helps with flexibility and keeps the muscles loose. It can also prevent soreness so we can hit the gym hard during workouts. Any specific mobility routines you all follow?\nOmen: To be honest, I love incorporating yoga stretches on my recovery days. It really helps my whole body feel rejuvenated and relaxed. Plus, it’s a great way to focus on breathing too! Have you all tried any specific stretches that work wonders for you?\nPhoenix: I usually do a mix of static stretches and foam rolling to help ease tension in my muscles. Feels so good post-workout! Focusing on areas that felt tight really helps me recover. What about you? Do you have a go-to stretch that you absolutely can’t skip?\nBrimstone: I always stretch my hamstrings, especially after leg days. It’s incredible how much better my legs feel afterward. I also foam roll my quads and glutes to release any knots. It makes a world of difference! How about you? Do you have a routine that really helps speed up recovery?\nOmen: I swear by a combination of foam rolling and deep static stretches, especially targeting my calves and back. It’s amazing how much looser I feel afterward! Plus, I try to hydrate well to speed up recovery too. Anyone else notice the impact of hydration on muscle recovery?\nLiHua: Definitely! Staying hydrated makes such a difference in recovery. I feel like it helps reduce soreness and keeps my energy levels higher! I try to drink enough water throughout the day, especially after workouts. What do you drink to stay hydrated?\nBreach: I usually stick with plain water, but I’ve been trying out some electrolyte drinks post-workout. They definitely help with my recovery after intense sessions! Plus, keeping things interesting with flavors is a bonus. How about you? Do you have any favorites for hydration?\nJett: I like mixing it up! Sometimes I'll add some lemon or electrolyte powders in my water for a refreshing twist. It keeps me motivated to drink more. Plus, rehydrating properly feels so good, especially after a tough workout. Any other hydration hacks you’ve found to be effective?\nCypher: I’ve been focusing on drinking water before my meals too. It not only keeps me hydrated but also helps control my appetite. Plus, I feel more energized during workouts! What about you guys? Have you noticed any changes in your performance based on your hydration habits?\nSage: I’ve definitely noticed a boost in my energy when I’m well-hydrated! It’s easier to push through tough workouts and recover afterward. Staying consistent with it makes a big difference. Do you find it hard to remember to drink enough water throughout the day?\nCypher: Yeah, sometimes I forget! I’ve set reminders on my phone to keep me on track. It might sound silly, but it really helps! Plus, carrying a water bottle everywhere has been a game changer. How do you all keep track of your water intake?\nLiHua: I usually just keep my water bottle filled and placed on my desk. It reminds me to sip throughout the day! Also, making it a habit to drink a glass right after waking up helps kickstart my hydration. What about you? Any tips for staying consistent with it?\nRaze: I like to set little goals, like finishing a certain amount of water by midday. It pushes me to stay consistent and I feel accomplished! Plus, if I have my bottle nearby, I tend to drink more. Have any of you tried hydration apps for tracking your intake?\nViper: I haven’t tried a hydration app yet, but that sounds pretty helpful! I usually just keep a mental note, but an app could keep me more accountable. Have you found it effective for maintaining your hydration goals?\nOmen: I’ve found it super useful! It reminds me when I need to drink more and keeps a log of my daily intake. It’s nice to see your progress! It helps me stay consistent, especially on busy days. Anyone else interested in trying it out?\nBreach: I think I might give it a shot! Anything that keeps me accountable sounds great. Plus, it might help learn more about my hydration habits. It'll be interesting to see how it improves my workout performance too!\nRaze: Definitely! It's cool to track that progress. Plus, having that extra motivation can make a huge difference in keeping our hydration game strong. Looking forward to hearing how it works out for you all!",
    "content_summary": "Time: 20260428_17:00\nSage: Hey everyone! So, I've been focusing on my breathing while squatting late...",
    "content_length": 9332,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week17\\20260428_1700.txt",
    "metadata": {
      "id": "doc_11",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week17\\20260428_1700.txt"
    },
    "created_at": "2025-09-01T16:59:39.475240",
    "updated_at": "2025-09-01T16:59:39.654986"
  },
  "doc-4c79c70ad719166c0813db6f68ba8dfd": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260317_15:30\nLiHua: Hey Yuriko! I can show you the final website this Thursday at 3pm if that works for you. How about we meet at Central Perk café? Looking forward to your feedback!\nYurikoYamamoto: That sounds great! I’ll be there. Excited to see the final result! 😊\nLiHua: Awesome! Can't wait to hear what you think. If you have any last-minute questions or changes, just let me know!\nYurikoYamamoto: Will do! I appreciate all your hard work on this. See you Thursday! ✨\nLiHua: Sounds good! See you then!",
    "content_summary": "Time: 20260317_15:30\nLiHua: Hey Yuriko! I can show you the final website this Thursday at 3pm if tha...",
    "content_length": 514,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week11\\20260317_1530.txt",
    "metadata": {
      "id": "doc_12",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week11\\20260317_1530.txt"
    },
    "created_at": "2025-09-01T16:59:41.108786",
    "updated_at": "2025-09-01T16:59:41.127343"
  },
  "doc-addb66bd145b4c2c70d4a7c635fa9551": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260907_14:00\nAdamSmith: Hey Li Hua! Hope you're doing well. Just wanted to check in and see how the basement held up after the storm. Any issues with water leakage? Let me know!\nLiHua: Hey Adam! The basement is all good, no water leakage at all. Just a bit damp, but nothing major. Thanks for checking in!\nAdamSmith: That's great to hear! Glad there's no leakage. If you need anything or decide to use the basement for storage, just let me know. Cheers!\nLiHua: Thanks, Adam! I appreciate it. If I need anything, I’ll definitely reach out. Hope you have a great day!\nAdamSmith: You too, Li Hua! Take care!",
    "content_summary": "Time: 20260907_14:00\nAdamSmith: Hey Li Hua! Hope you're doing well. Just wanted to check in and see ...",
    "content_length": 612,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week36\\20260907_1400.txt",
    "metadata": {
      "id": "doc_13",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week36\\20260907_1400.txt"
    },
    "created_at": "2025-09-01T16:59:42.670801",
    "updated_at": "2025-09-01T16:59:42.691511"
  },
  "doc-c8d89524d032cc07376064809227e195": {
    "status": "processed",
    "chunks_count": 7,
    "content": "Time: 20261001_18:00\nJakeWatson: Hey everyone! Just a reminder to always drink water before and during the match. And try to have some electrolytes too, they really help! Staying hydrated keeps your energy up on the field! ⚽️💦\nIvor: Totally agree! I usually make sure to hydrate well the day before a game too. It really makes a difference. Anyone else have any hydration tips?\nJakeWatson: That’s so true! I also like to drink coconut water. It's packed with electrolytes and tastes great! Perfect for a post-match refresh! 🌴🥥\nCaspian: If anyone’s looking to practice, maybe we can get together this weekend? I’m thinking Saturday afternoon, and we could work on our passing skills! What do you all think?\nCaspian: Sounds good! I could use some practice on my passing too. What time were you thinking?\nHenley: I'm down for Saturday, but how about 3 PM? That way we have enough time to practice before it gets dark. Let's really focus on those short passes!\nLiHua: 3 PM works for me! Looking forward to it! Let’s show off those skills! ⚽️💪\nAurora: Great! I'll see you all at 3 PM on Saturday. Can't wait to practice those passing drills! 💪⚽️\nJasper: Hey guys, just wanted to say this practice is gonna be awesome! Looking forward to working on those passes with all of you. Let's have fun! 😄⚽️\nCaspian: Hey everyone! What do you all think about focusing on our accuracy during the passing drills? It would really help in actual matches!\nGiselle: Absolutely! Accuracy is key in games. If we nail those passes, it’ll really make a difference in our play! Looking forward to working on it!\nDacey: For sure! Maybe we could do some target practice too? Set up some cones and aim for them while passing. That could help sharpen our skills! What do you all think?\nBriar: Love that idea! Target practice sounds fun and super useful. Let’s bring a few cones along, and we can set them up wherever we practice. It’ll be a blast!\nIvor: Can’t wait for Saturday! This is gonna be epic! Let’s make sure we all remind each other to stay hydrated during practice too! 💧\nBriar: Definitely! Staying hydrated is solid advice, especially during practice. Let’s all bring our water bottles! 🥤⚽️\nGiselle: I'm excited for Saturday, everyone! Don’t forget to bring your water! We'll be running around a lot, so hydration is a must!\nIvor: Haha, for sure! We’ll need all the hydration to keep our energy up! Can’t wait to see you all at 3 PM!\nBriar: Let’s bring our A-game this Saturday! It’ll be great to practice together and improve our skills. See you all at 3 PM!\nGiselle: Looking forward to it! It’s gonna be a great way to kick off the weekend! Let's hit those passing drills! 🏃‍♂️💨\nGiselle: Hey everyone, just a reminder to stretch before practice too! Helps prevent any injuries while we're out there practicing! 🏃‍♀️💪\nJakeWatson: Good call! Stretching is crucial. We should take a few minutes before starting so we’re all warmed up and ready to go! 🌟\nAurora: Absolutely! Stretching can really help keep us agile on the field. Let’s make it a part of our routine! Can't wait! 😊\nFarrah: Don't forget to bring your favorite water bottles too! It keeps us hydrated and motivated! 💧⚽️\nDacey: For sure! Gotta have our bottles ready! It’s all about keeping that energy high while having fun! Let’s make it awesome! 🎉⚽️\nDacey: I'll make sure to bring my favorite drink too! Staying hydrated and enjoying the process is what it's all about! See everyone Saturday!\nLiHua: Same here! Can't wait to see everyone and have a great practice! Let’s make it a fun one! 🎶⚽️\nAurora: Yeah! It’s going to be a blast. I’m excited to improve our skills together. See you all then! 🎉\nEvangeline: I definitely think we can learn a lot from each other. This practice is gonna be so much fun! Let’s keep the vibe high! 😊⚽️\nHenley: Can't wait for Saturday, everyone! It's gonna be epic! Remember to bring your water and enthusiasm! Let's crush those passing drills! 💪⚽️\nAurora: Let’s get ready to make some great improvements on Saturday! Looking forward to it! ✨\nIvor: I'm really excited to see how we all improve our passing and accuracy together this weekend! It’ll be a great bonding experience too! See you at 3 PM!\nJasper: It's gonna be awesome, can't wait! Let’s show up ready to put in the effort and have a blast! See you all on Saturday! 🎉⚽️\nIvor: Totally pumped! Let’s bring our energy and skills to the field! It's gonna be a great time practicing together. See you all soon!\nGiselle: Just a heads up, everyone! Make sure to wear comfortable shoes to practice. It’ll help with our movement during the drills! 🏃‍♀️👟\nEvangeline: Good reminder! Proper footwear is essential, especially when we’re working on those passing drills. Let’s make sure we’re all set!\nEvangeline: Looking forward to making some great plays together on Saturday! It’s gonna be so much fun!",
    "content_summary": "Time: 20261001_18:00\nJakeWatson: Hey everyone! Just a reminder to always drink water before and duri...",
    "content_length": 4828,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week39\\20261001_1800.txt",
    "metadata": {
      "id": "doc_14",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week39\\20261001_1800.txt"
    },
    "created_at": "2025-09-01T16:59:44.337552",
    "updated_at": "2025-09-01T16:59:44.448844"
  },
  "doc-d8d71bca6bcbcda860e80d60d5d35a1d": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260615_09:00\nJenniferMoore: Hey Li Hua! Hope you’re doing well! Would it be possible to push our session tomorrow to 10:30am instead of 10:00am? Let me know! 😊\nLiHua: Sure, 10:30am works for me! See you then! 💪 🎸\nJenniferMoore: Awesome, thanks for being flexible! Looking forward to it. Let’s crush that workout! 💥\nLiHua: You got it! Can't wait! Let's go! 💪😄\nJenniferMoore: Let’s give it our all tomorrow! See you at 10:30!",
    "content_summary": "Time: 20260615_09:00\nJenniferMoore: Hey Li Hua! Hope you’re doing well! Would it be possible to push...",
    "content_length": 431,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week24\\20260615_0900.txt",
    "metadata": {
      "id": "doc_15",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week24\\20260615_0900.txt"
    },
    "created_at": "2025-09-01T16:59:46.377294",
    "updated_at": "2025-09-01T16:59:46.399853"
  },
  "doc-c4bac505a7a4784fc1b688e2b8871c66": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20261022_22:00\nJenniferMoore: Hey Li Hua! 🎉 Just wanted to say congrats on pushing your limits with the planks this week! 💪 You're making amazing progress! Keep it up! 💥\nLiHua: Thanks, Jennifer! I really appreciate the encouragement! Just trying to stay focused and improve. Looking forward to our next session! 😊\nJenniferMoore: You're totally on the right track! It's all about consistency and keeping that mindset strong. Can't wait to see what you show me in our next session! 🌟\nLiHua: Definitely! I'm excited for it too. I feel like I'm getting stronger each week. See you soon! 💪\nJenniferMoore: That's the spirit! Strength gains are such a rewarding feeling. Remember to stay hydrated and rest up. See you Tuesday! 🌈💖\nLiHua: Will do! Thanks for the reminder. I'll make sure to take care of myself. See you Tuesday! 😄",
    "content_summary": "Time: 20261022_22:00\nJenniferMoore: Hey Li Hua! 🎉 Just wanted to say congrats on pushing your limits...",
    "content_length": 827,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week42\\20261022_2200.txt",
    "metadata": {
      "id": "doc_16",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week42\\20261022_2200.txt"
    },
    "created_at": "2025-09-01T16:59:48.576592",
    "updated_at": "2025-09-01T16:59:48.603110"
  },
  "doc-fe507a84af004f6890da1d09c0cd6ba6": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260516_08:14\nAlice: I am Alice from Hailey's bakery. Your bread has been delivered, please come and pick it up ASAP. Have a good day : )",
    "content_summary": "Time: 20260516_08:14\nAlice: I am Alice from Hailey's bakery. Your bread has been delivered, please c...",
    "content_length": 144,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\bakery_deliver\\20260516.txt",
    "metadata": {
      "id": "doc_17",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\bakery_deliver\\20260516.txt"
    },
    "created_at": "2025-09-01T16:59:50.805867",
    "updated_at": "2025-09-01T16:59:50.819400"
  },
  "doc-afd4cf6e494381b30bf09739eae250b7": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260527_16:00\nHaileyJohnson: Hey Li Hua! 🌟 Just wanted to let you know that this weekend, we’re hosting a free baking class at the bakery! 🎉 You can just walk in and join. Hope to see you there! 🍞🥐\nLiHua: That sounds awesome! I’m definitely gonna check it out this weekend. Can’t miss free baking! 😄🥖 Thanks for the invite!\nHaileyJohnson: Yay! So happy you'll be there! It'll be a fun time baking together. Let me know if you have any questions! 😊❤️\nLiHua: Will do! Can't wait to see what we bake up together! 🍰🥳\nHaileyJohnson: It's going to be a blast! I'm really looking forward to it. See you soon! 🎊👩‍🍳",
    "content_summary": "Time: 20260527_16:00\nHaileyJohnson: Hey Li Hua! 🌟 Just wanted to let you know that this weekend, we’...",
    "content_length": 613,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week21\\20260527_1600.txt",
    "metadata": {
      "id": "doc_18",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week21\\20260527_1600.txt"
    },
    "created_at": "2025-09-01T16:59:53.180833",
    "updated_at": "2025-09-01T16:59:53.204377"
  },
  "doc-c13f597cc7d58f32274ed3bba87c5f2f": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260711_11:00\nChaeSong-hwa: Hey LiHua, check out this new research article by a group of American scientists on how to fall asleep faster at night!\nLiHua: I just read it! Learned a lot! Thanks for sharing it with me!\nChaeSong-hwa: Glad you found it helpful! Sleep is so important for us, especially with our busy schedules. Let me know if you want more tips or articles like this!\nLiHua: For sure! Sleep is crucial for recovery after those long days. I’ll definitely keep that in mind. Thanks again for sharing!\nChaeSong-hwa: No problem! We all need to take care of ourselves. Maybe we can plan a chill night soon, just unwind a bit? What do you think?\nLiHua: Sounds great! A chill night would be perfect.",
    "content_summary": "Time: 20260711_11:00\nChaeSong-hwa: Hey LiHua, check out this new research article by a group of Amer...",
    "content_length": 712,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week27\\20260711_1100.txt",
    "metadata": {
      "id": "doc_19",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week27\\20260711_1100.txt"
    },
    "created_at": "2025-09-01T16:59:55.627121",
    "updated_at": "2025-09-01T16:59:55.653339"
  },
  "doc-51500f527ced6ced90102d7eac6e1375": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260422_08:21\nAlice: I am Alice from Hailey's bakery. Your bread has been delivered, please come and pick it up ASAP. Have a good day : )",
    "content_summary": "Time: 20260422_08:21\nAlice: I am Alice from Hailey's bakery. Your bread has been delivered, please c...",
    "content_length": 144,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\bakery_deliver\\20260422.txt",
    "metadata": {
      "id": "doc_20",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\bakery_deliver\\20260422.txt"
    },
    "created_at": "2025-09-01T16:59:58.139627",
    "updated_at": "2025-09-01T16:59:58.153187"
  },
  "doc-e22918849bd19caf74c561efbf6a615e": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20261019_20:00\nAdamSmith: Hey, Li Hua! Just wondering if the curtains are still all good now that you have been using them for a while.\nLiHua: They are perfect! I'm more than satisfied!\nAdamSmith: Great to hear you're satisfied! If you need anything else or have any questions about it, just let me know. Also, if you ever want to use that basement for extra storage, it's ready when you are!\nLiHua: The curtain is excellent, totally meets my expectations. Thanks again for all your help with the place!\nAdamSmith: I'm glad to help! Always aiming to make things comfortable for you. Let me know if there's anything else you need!\nLiHua: Will do! Appreciate your support!",
    "content_summary": "Time: 20261019_20:00\nAdamSmith: Hey, Li Hua! Just wondering if the curtains are still all good now t...",
    "content_length": 676,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week42\\20261019_2000.txt",
    "metadata": {
      "id": "doc_21",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week42\\20261019_2000.txt"
    },
    "created_at": "2025-09-01T17:00:00.639066",
    "updated_at": "2025-09-01T17:00:00.664223"
  },
  "doc-9a5e3991bf8576ca2b09c937e3017f03": {
    "status": "processed",
    "chunks_count": 7,
    "content": "Time: 20260612_15:00\nTuralyon: Hey everyone! Just wanted to give you all a quick update on the garden renovation. The children's play area is now complete! 🎉 Do you have any ideas for features we could add to make the garden even better? Let me know!\nThrall: Nice work on the play area! 🌟 Maybe we could add some outdoor games or a small water feature? It could be super fun for the kids! What do you all think?\nLiHua: Great ideas, Thrall! How about adding picnic tables for families to enjoy some snacks after playing? It could create a nice gathering spot! \nThrall: I love that idea, Li Hua! 🍉 Picnic tables would definitely make it more inviting for families. We could also think about planting a few berry bushes nearby to make it even more fun! Any thoughts?\nGromHellscream: Berry bushes sound awesome! 🌱 Also, maybe we could create a little garden area where kids can help plant flowers or vegetables. It'd be a fun learning experience for them!\nMalfurionStormrage: That's a fantastic idea, Grom! 🌼 I think involving kids in planting could really spark their interest in nature. Would anyone else like to add more ideas to this?\nMalfurionStormrage: Let's also think about incorporating a small book nook with chairs for reading. What do you all think?📚 \nArthasMenethil: Those are some cool ideas! A book nook would be a great way to encourage reading among the kids. Plus, it can be a peaceful spot for everyone to relax. Would it be possible to add some shade around that area?\nMuradinBronzebeard: Sounds like a plan! Shade would definitely make it more comfortable. Maybe we could use some tall plants or even install a canopy? What do you think, everyone? 🌳\nChaeSong-hwa: All great suggestions! A canopy would look nice and provide protection from the sun. Let's make sure we consider the overall layout when we finalize our ideas!\nTirionFordring: Loving all the creativity here! 🌻 It’s important to keep everything harmonized for the layout. Let’s make a list of these suggestions so we can see what fits best into our plans!\nIllidanStormrage: Awesome! I’m looking forward to seeing how all these ideas come together. Keep up the great work, everyone! 🌸\nThrall: Turalyon has been really proactive in getting the garden project going! Every new suggestion makes it more exciting. Can't wait to see it all come together! 🌟🥳\nRexxarRemar: Just wanted to remind everyone we have to keep focusing on ideas for the garden. Let’s make sure we’re not veering off into other topics!\nAdamSmith: Absolutely! Keeping the focus on the garden is key. Everything sounds promising so far. Can’t wait to see the final outcome!\nArthasMenethil: Great to see everyone so enthusiastic! Let's continue brainstorming and refining our ideas for the garden. It'll be a lovely community space once it's all done! 🌺\nGromHellscream: I agree! The garden is shaping up nicely! Let's keep the momentum going and finalize some of these ideas soon! 💪🌿\nTuralyon: Thanks for all the great suggestions! I’ll keep track of everything discussed so far. Can’t wait to implement these ideas!\nLiHua: Looks like we’re making some solid progress on the garden! Excited to see how everything turns out. Let’s keep those ideas coming! \nArthasMenethil: Totally! The more ideas we share, the better the space will be. Can't wait to see it all come together! 🌈\nTirionFordring: Let's make sure we have a plan to prioritize the suggestions we've come up with. That way, we can efficiently put them into action without getting overwhelmed!\nRexxarRemar: Definitely a good idea to organize everything! We can rank the suggestions based on importance or feasibility. That will help us keep things streamlined!\nLiHua: I think we’re on the right track! With teamwork like this, the garden is going to be fantastic. 🌼 Let’s keep the spirit high!\nGromHellscream: Yeah, let's keep pushing forward! The garden is going to be epic! 🌿💥\nLiHua: Excited for the updates as we move forward! Can’t wait to see our ideas in action!\nMuradinBronzebeard: I'm feeling really positive about this project! Let’s make sure we keep the communication going and see how we can bring our ideas to life! 🌟\nTuralyon: Looking forward to seeing everyone's ideas become real! Let’s keep the energy up and make it an awesome space for everyone! 🌻✊\nThrall: Can’t wait to see the progress! We’re building something special together, and that’s what matters! 🌈\nRexxarRemar: Let's keep the focus on the community garden ideas! What else should we brainstorm together? 🌿🤔\nArthasMenethil: Looking forward to more suggestions! Let's keep refining our plans so we can finalize everything soon! 🌟\nTuralyon: Absolutely! The more we collaborate, the better it will be! Let's make sure to keep brainstorming until we've got it all figured out!\nAdamSmith: I’m glad to see everyone so engaged! Let’s continue sharing thoughts on the garden so we can finalize our plans soon.\nArthasMenethil: Looking forward to the final decisions on the garden! Every idea counts, so let's keep it coming! 🌼\nLiHua: This is shaping up to be an amazing community project! Can't wait to see it all come together. Let's keep the ideas flowing! 🌳\nTirionFordring: Just a reminder, everyone, that we should stick to discussing features for the garden only. It helps us stay organized and focused! 🌿\nLiHua: Got it! Let's keep our ideas focused on the garden features. I'm excited to see how it all turns out! 🌸",
    "content_summary": "Time: 20260612_15:00\nTuralyon: Hey everyone! Just wanted to give you all a quick update on the garde...",
    "content_length": 5395,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week23\\20260612_1500.txt",
    "metadata": {
      "id": "doc_22",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week23\\20260612_1500.txt"
    },
    "created_at": "2025-09-01T17:01:11.321892",
    "updated_at": "2025-09-01T17:01:11.428113"
  },
  "doc-608802d26630444a57c3070cc7f581a2": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260309_12:00\nLiHua: Hey Jennifer! Hope you’re doing well! Quick question, is it possible to switch my class from Thursday to Friday this week? Let me know! Thanks!\nJenniferMoore: Hey! I'm doing great, thanks! 😊 Yes, we can definitely switch your class to Friday this week. What time works best for you?\nLiHua: Awesome! How about the same time, 10:00am? Looking forward to it!\nJenniferMoore: Perfect! I've got you down for Friday at 10:00am. Can't wait to see you then! 💪🏼\nLiHua: Thanks, Jennifer! See you on Friday!",
    "content_summary": "Time: 20260309_12:00\nLiHua: Hey Jennifer! Hope you’re doing well! Quick question, is it possible to ...",
    "content_length": 523,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week10\\20260309_1200.txt",
    "metadata": {
      "id": "doc_23",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week10\\20260309_1200.txt"
    },
    "created_at": "2025-09-01T17:01:14.357955",
    "updated_at": "2025-09-01T17:01:14.387171"
  },
  "doc-182889c8ae3097757853b5e162ce93b9": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260312_12:30\nAdamSmith: Hey Li Hua! There's a community bake sale this Sunday at 3 PM to support a local charity. It would be great if you could join. Let me know if you’re interested!\nLiHua: That sounds fun! I’d love to help out and enjoy some baked goodies. Count me in! 🍰\nAdamSmith: Awesome! It'll be a nice way to meet some neighbors too. Looking forward to it!\nLiHua: Yeah, it’s always great to connect with the community! Let me know if you need any help setting things up. 😊\nAdamSmith: Thanks for the offer! I think we’ll manage, but I’ll reach out if we need an extra hand. Appreciate it!\nLiHua: Sounds good! Just give me a shout if you do. See you at the bake sale! 🍪",
    "content_summary": "Time: 20260312_12:30\nAdamSmith: Hey Li Hua! There's a community bake sale this Sunday at 3 PM to sup...",
    "content_length": 684,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week10\\20260312_1230.txt",
    "metadata": {
      "id": "doc_24",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week10\\20260312_1230.txt"
    },
    "created_at": "2025-09-01T17:01:17.440373",
    "updated_at": "2025-09-01T17:01:17.465331"
  },
  "doc-6c184b01d5f088d78af9427b7f7f2db0": {
    "status": "processed",
    "chunks_count": 7,
    "content": "Time: 20260727_16:30\nTirionFordring: Hey everyone! As we have posted around the community bulletin board, the community sports day happening soon! It’s a great chance to get involved, meet neighbors, and have some fun! 🏐🏃‍♀️ Let’s make it a day to remember! Who’s excited?\nIllidanStormrage: Sounds like a blast! I hope there are some fun activities for everyone, especially the kids. They love to run around! What sports are we thinking about?\nChaeSong-hwa: I’m looking forward to it! It’ll be nice to take a break from our usual routines and enjoy some outdoor fun. Let’s show our support!\nTirionFordring: Absolutely! It’ll be a great way to bond and enjoy the garden once it’s renovated. Fingers crossed for some good weather! 🌞 What activities do you all want to see?\nLiHua: I’d love to see some team sports like soccer or basketball! They always get everyone pumped up. Plus, we could throw in some fun games for the kids too!\nAdamSmith: Great idea! Team sports really bring people together. Maybe we can set up some friendly competitions? Would be awesome to have everyone participate!\nThrall: Can we also consider adding some fun activities for families? Like a tug-of-war or maybe a sack race? Those are always a hit! 🥳\nRexxarRemar: For sure! And how about some refreshments too? I think having some snacks and drinks available would keep everyone energized through all the games!\nGromHellscream: The garden's looking good for the sports day! Can't wait to see everyone come together for some fun. It'll be an epic event! \nLiHua: I can’t wait to see the new garden! It'll be the perfect backdrop for all the activities. Plus, those benches will be great for everyone to chill after a game!\nGromHellscream: Looking forward to the refreshments too! Keeping everyone fueled up is important. Let’s make it a memorable day!\nMuradinBronzebeard: This sports day is gonna be fantastic! Having all the fun together in the garden and enjoying the new benches will make it even better. Let’s get everyone involved!\nAdamSmith: It sounds like it's going to be a fantastic day! I really like the ideas everyone's putting forth. It'll be great to see the community come together for some good times.\nArthasMenethil: I'm excited to see the transformations in the garden soon! Can't wait for everyone to enjoy the space, especially with the new additions. The sports day is a perfect time to celebrate that.\nLiHua: It’ll definitely be a fun way to enjoy the new garden! Can’t wait to see how everyone participates and what activities we’ll end up doing. 🎉\nAdamSmith: It'll be interesting to see the community spirit at play! I hope lots of families come out to have fun together. Let's make it a day full of good memories!\nArthasMenethil: Let's make sure we spread the word so everyone knows about the event! The more, the merrier! Plus, who doesn't love a bit of friendly competition? 🎉\nIllidanStormrage: Looking forward to it! A well-loved space like our garden deserves such lively events. Let’s keep the excitement going!\nTirionFordring: Sounds like we all agree this will be a great time! Let’s keep the energy up and make sure everyone has a blast at the sports day! 🥳\nTuralyon: Let's continue sharing ideas to make this event even more exciting! I'm loving all the enthusiasm!\nTuralyon: Just thinking about how we could set up a schedule for all the activities during the sports day. It'll help keep things organized and fun for everyone! \nAdamSmith: Great idea! A schedule would definitely help everyone know what's happening when. It’ll keep the day running smoothly and maximize the fun!\nMalfurionStormrage: Absolutely! If we can set up a rotation for the activities, everyone can participate without feeling rushed. Plus, it allows time for breaks in between!\nGromHellscream: Yes! Breaks are just as important. Let’s make sure we have some downtime to enjoy the garden too, especially with the new benches.\nRexxarRemar: I think having a mix of active and relaxed moments will make the day even better! Let’s keep the ideas flowing!\nIllidanStormrage: Such a solid plan! Balancing activities and leisure time will keep everyone's spirits high. Let's keep our thoughts together for this sports day!\nLiHua: Totally agree! It'll keep the vibe chill and fun for everyone. Super excited for all the planning coming together! 🌟\nArthasMenethil: I’m looking forward to seeing how it all unfolds. With everyone’s contributions, this sports day is shaping up to be an awesome event for the community!\nTuralyon: Let’s keep sharing any last-minute ideas or suggestions as we prepare for the event! Every bit helps make it better.\nLiHua: Yeah, definitely! Let's keep the momentum going as we finalize everything. Excited for the big day! 🏅\nThrall: I’m sure this will be a day to remember! Can't wait to see everyone having a blast in the renovated garden. Let’s keep the discussions going!\nRexxarRemar: This is gonna be epic! The renovated space will bring so much joy to everyone. How about we think about decorations too? Maybe some banners or flags? 🎉\nTirionFordring: That sounds like a fun idea! Decorations could really add to the festive vibe. We could even get the kids involved in making some crafts for it!\nArthasMenethil: Let’s encourage everyone to participate in creating decorations! It’d be a great way to bring the community together even more before the sports day.\nTuralyon: Absolutely! Crafting decorations can be a fun way for families to get involved and showcase their creativity. It's gonna make the event even more special!\nArthasMenethil: Everyone’s really getting into the spirit, love it! Can't wait to see how everything comes together for the sports day. Let’s keep the ideas rolling! 🎈",
    "content_summary": "Time: 20260727_16:30\nTirionFordring: Hey everyone! As we have posted around the community bulletin b...",
    "content_length": 5700,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week30\\20260727_1630.txt",
    "metadata": {
      "id": "doc_25",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week30\\20260727_1630.txt"
    },
    "created_at": "2025-09-01T17:01:20.517223",
    "updated_at": "2025-09-01T17:01:20.629393"
  },
  "doc-6744be8aacbb5dc28b515dfc31c967a9": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20261218_18:00\nChaeSong-hwa: Hey Li Hua! Check out this article about how human beings form short-term and long-term memories!\nLiHua: Wow, I just read it, and I'm really shocked how intricate our brains are!\nChaeSong-hwa: That's really interesting, right? Our brains are so fascinating! The way we process and store memories can change so much over time. It's like our experiences shape how we remember stuff. \nLiHua: Absolutely! It's mind-blowing how things like emotions and context can influence our memories. Makes you appreciate the little moments even more!\nChaeSong-hwa: Totally! Even the smallest experiences can leave a big mark on us. It’s great to think about how we can use this knowledge to help others, especially our patients. \nLiHua: Yeah, that's a great point! Understanding memory can really help in so many fields, especially in therapy and education. Plus, it’s nice to know that we can improve our memory over time with practice!\nChaeSong-hwa: Exactly! Engaging in activities that challenge our brain can boost memory. It's like a workout for our minds! And remember, learning new things, like our music sessions, can also help keep our brains sharp!\nLiHua: So true! It's all about keeping things fresh and exciting. Our jam sessions are definitely good for the brain and a lot of fun too! Can't wait for the next one! \nChaeSong-hwa: Same here! It's always a blast playing together. Plus, it's a perfect way to unwind after our busy weeks. Let's keep the energy going!\nLiHua: For sure! Music really brings everyone together. It's a great escape and a way to express ourselves. I'm looking forward to the next jam!",
    "content_summary": "Time: 20261218_18:00\nChaeSong-hwa: Hey Li Hua! Check out this article about how human beings form sh...",
    "content_length": 1640,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week50\\20261218_1800.txt",
    "metadata": {
      "id": "doc_26",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week50\\20261218_1800.txt"
    },
    "created_at": "2025-09-01T17:01:23.825713",
    "updated_at": "2025-09-01T17:01:23.862844"
  },
  "doc-ddb0d87b57363b2cb71ea4828e32aa9a": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260408_13:00\nWolfgangSchulz: Hey! Man, I'm really burnt out from all the overtime lately. Can't wait for Sunday to unwind a bit. How's everything with you?\nLiHua: I get that! Overtime can really drain you. I've been exploring the city a lot and trying to keep my spirits up. Looking forward to our jam session too! Any chance you can sneak in some time for yourself before Sunday?\nWolfgangSchulz: I wish! But it feels like work just keeps piling up. I’ll have to tough it out until the weekend. Need that session to recharge! What are you thinking of playing this time?\nLiHua: I was thinking we could mix it up a bit! Maybe try some new songs or even work on some original stuff? Let’s see where our creativity takes us! What do you think?\nWolfgangSchulz: Sounds cool! I'm always up for mixing things up a bit. Original stuff could be fun! Just need to make sure we keep the Beatles vibe in there, too. Can't wait!\nLiHua: Totally! A bit of nostalgia with some fresh tunes sounds perfect. It'll be great to let loose and create together. Just a few more days! 🎶\nWolfgangSchulz: Yeah, I can almost feel the rhythm already! It's nice to have something to look forward to after all this work. Let’s make it a good one! 🎸🥁\nLiHua: Absolutely! We'll definitely make it memorable. Just hang in there until then! 🎶😊",
    "content_summary": "Time: 20260408_13:00\nWolfgangSchulz: Hey! Man, I'm really burnt out from all the overtime lately. Ca...",
    "content_length": 1314,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week14\\20260408_1300.txt",
    "metadata": {
      "id": "doc_27",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week14\\20260408_1300.txt"
    },
    "created_at": "2025-09-01T17:01:27.209276",
    "updated_at": "2025-09-01T17:01:27.245153"
  },
  "doc-48961762ef4c121df3fa16dd2b43f4bf": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260121_13:00\nWolfgangSchulz: Hey! Want to check out \"Overwatch 3\" tomorrow? Should be fun! 🎬\nLiHua: Sounds awesome! I'm totally in! What time are we thinking? 😊\nWolfgangSchulz: Great! How about we catch the 7 PM show? Gives us time to grab some food before. 🍕\nLiHua: 7 PM works for me! Food first sounds like a plan! Let’s pick a place we both like. Any thoughts? 😄\nWolfgangSchulz: How about that new burger place near the cinema? I've heard good things! 🍔\nLiHua: That sounds delicious! I've been wanting to try it. Let’s do it! See you tomorrow! 🍔🎥",
    "content_summary": "Time: 20260121_13:00\nWolfgangSchulz: Hey! Want to check out \"Overwatch 3\" tomorrow? Should be fun! 🎬...",
    "content_length": 557,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week3\\20260121_1300.txt",
    "metadata": {
      "id": "doc_28",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week3\\20260121_1300.txt"
    },
    "created_at": "2025-09-01T17:01:30.746598",
    "updated_at": "2025-09-01T17:01:30.770156"
  },
  "doc-1844cbf15e87a346bac192889cc96d4a": {
    "status": "processed",
    "chunks_count": 3,
    "content": "Time: 20261124_14:00\nThaneChambers: Hey Li Hua, I saw you were online pretty late last night. Just a friendly reminder to not stay up too late playing games, alright? It's easy to lose track of time. Get some good rest! 😊🎮\nLiHua: Haha, thanks Thane! I'll try to keep that in mind. The games are just so addictive sometimes! 😅 What have you been playing lately?\nThaneChambers: I get that! I've been hooked on \"Black Myth: Wukong\". The visuals are stunning, and the story is super immersive. Have you checked it out yet?\nLiHua: Yeah, \"Black Myth: Wukong\" is awesome! I love how the gameplay feels so dynamic. I can't wait to unlock more abilities. Have you found any cool features in it?\nThaneChambers: Definitely! The way you can combo different abilities is really fun, and some of the boss battles are epic. Plus, the environments are just breathtaking! It makes exploring so much more enjoyable. What part do you like best so far?\nLiHua: I really enjoy the exploration aspect too! Each area feels so unique and detailed. Plus, the lore behind the characters is fascinating. Did you find any hidden secrets while playing?\nThaneChambers: Yeah, I stumbled upon a few hidden spots! There are some cool collectibles and side quests that give more depth to the story. It's always exciting to discover something new. Are you planning to play more this weekend?\nLiHua: For sure! I’m planning a gaming marathon. I can't wait to get deeper into the story. What about you? Any gaming plans for the weekend?\nThaneChambers: I’m thinking of hosting a game night with some friends! 🕹️ It’ll be fun to try out some co-op games. Let me know if you want to join! We can have a blast together! \nLiHua: Sounds like a great time! I'd love to join in! Just let me know the details. 🎉 What games do you have in mind for the night?\nThaneChambers: I’m thinking of mixing it up with some classics like \"Rocket League\" and maybe \"Overcooked\" for some chaotic fun. What do you think? Ready for some friendly competition? 😄\nLiHua: I'm totally up for it! \"Overcooked\" always brings the chaos, and it's hilarious! Can't wait! Just let me know when and where! 🍕🎮",
    "content_summary": "Time: 20261124_14:00\nThaneChambers: Hey Li Hua, I saw you were online pretty late last night. Just a...",
    "content_length": 2132,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week47\\20261124_1400.txt",
    "metadata": {
      "id": "doc_29",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week47\\20261124_1400.txt"
    },
    "created_at": "2025-09-01T17:01:34.391612",
    "updated_at": "2025-09-01T17:01:34.440799"
  },
  "doc-9fb92cf5f5389391fb7dafa22c3afb7d": {
    "status": "processed",
    "chunks_count": 5,
    "content": "Time: 20260427_14:30\nLiHua: Hey team! 😊 How about we start organizing our Sunday nights like a real band? It could be fun! 🎸🥁🎤 What do you all think?\nWolfgangSchulz: Sounds cool! I'm all in for making it more official. Just let me know the plans!\nYurikoYamamoto: Yay! Official band sounds exciting! 🎶 We can decide on songs and maybe even perform someday! What do you all think we should start with? 😊\nYurikoYamamoto: I'm down for that! Maybe we should pick a theme for our next jam? 😄 What do you guys prefer?\nWolfgangSchulz: I'm good with anything, but I love the classics! Maybe some more Beatles or other iconic tracks? Let's keep the vibe fun! 🎵\nLiHua: Totally! Beatles are always a hit! 🎸 How about we each suggest a couple of songs, then we can vote? Keep it lively! 🎶\nLiHua: We could also try to blend different genres! It would showcase everyone's style and make it unique! What do you think?\nWolfgangSchulz: That sounds awesome! Mixing genres could be a lot of fun. Can't wait to see what everyone suggests!\nChaeSong-hwa: Let's definitely give that a shot! Mixing it up can bring some fresh energy. Looking forward to hearing everyone's ideas! 🎤✨\nWolfgangSchulz: Can't wait to see all the song ideas! Let's make our Sundays even more epic! 🎉\nYurikoYamamoto: We can each send our song ideas by the end of the week, then! 🎶 It'll be exciting to see what everyone comes up with!\nYurikoYamamoto: Let’s aim for a good mix to showcase our styles! I'm really looking forward to our next session! 🎸✨\nWolfgangSchulz: Yeah, it's gonna be so much fun! Just let me know the best way to share ideas!\nChaeSong-hwa: We could make a shared document or just drop them in here! Whatever's easier for everyone! 😊 \nYurikoYamamoto: A shared document sounds great! That way we can all see the list and keep adding! 📄🎶\nYurikoYamamoto: Once we have everyone's suggestions, we can finalize the setlist for our next jam! Exciting! 😄\nChaeSong-hwa: Can't wait to see all the ideas! It'll be great to put together an awesome setlist! 🌟\nLiHua: Okay, sounds like we have a plan! Let's get those song ideas rolling! 🎶 Can't wait to jam together!\nLiHua: Haha, looks like we've got this band thing going strong! It's gonna be a blast! 🎉\nWolfgangSchulz: Absolutely! Sunday nights just got a whole lot more exciting! I'm looking forward to it! 🎵👊\nYurikoYamamoto: Me too! Let's make it a night to remember! 🌟 Can't wait for our next session, everyone!\nWolfgangSchulz: So pumped for it! This is gonna be epic! 🎸✨\nYurikoYamamoto: Let's keep the energy high and make some awesome music together! 🎶\nWolfgangSchulz: I'm all about that! Gonna be an amazing vibe on Sunday! 🌈🎤\nWolfgangSchulz: Looking forward to it! Let’s make some magic happen! 😊✨\nChaeSong-hwa: It's gonna be magical for sure! Can't wait! 🎵🌟\nLiHua: Let’s keep the excitement going! Can’t wait for our jam session! 🎸✨ \nChaeSong-hwa: It's really going to be a blast! Just thinking about it makes me smile! 🎤💖",
    "content_summary": "Time: 20260427_14:30\nLiHua: Hey team! 😊 How about we start organizing our Sunday nights like a real ...",
    "content_length": 2940,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week17\\20260427_1430.txt",
    "metadata": {
      "id": "doc_30",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week17\\20260427_1430.txt"
    },
    "created_at": "2025-09-01T17:01:38.210724",
    "updated_at": "2025-09-01T17:01:38.273364"
  },
  "doc-91b6bd3b22ae2ae9dd03798ccdb009d0": {
    "status": "processed",
    "chunks_count": 5,
    "content": "Time: 20260801_15:00\nWolfgangSchulz: Hey everyone! 🎵 What do you think about including some original songs in our setlist? We could brainstorm some cool ideas during practice! 🤔 \nWolfgangSchulz: I'm really looking forward to creating something unique together! Let's discuss our thoughts tomorrow night! \nLiHua: Yeah, I'm all in for it! It'll be fun to mix it up a bit! ✨ Any themes you guys are thinking about? \nChaeSong-hwa: I love the idea of exploring themes that resonate with us. Let's play around with some emotions or experiences we can all connect to! 😊\nLiHua: Sounds perfect! 🎶 We could even draw inspiration from our own stories or adventures. It'll make our music even more meaningful!\nWolfgangSchulz: Definitely! Personal stories can add so much depth to our songs. Can't wait to see what we all come up with! 🎤🎸\nChaeSong-hwa: I'm excited to hear everyone's thoughts and ideas! Together, we can create something amazing! 🌟\nYurikoYamamoto: Totally! Let's let our creativity flow and see where it takes us. 🎶 Can't wait for practice!\nLiHua: Absolutely! It's going to be a blast. See you all tomorrow night! Let's make some magic happen! 🎸🌟\nChaeSong-hwa: Yeah, it's going to be fun! I can't wait to jam together and bring our ideas to life! 😊\nYurikoYamamoto: Let’s get those creative juices flowing! 🎶 Tomorrow will be exciting for sure!\nYurikoYamamoto: I think we’re going to come up with some great stuff! Let’s make the most of our time together!\nChaeSong-hwa: I agree! I'm really looking forward to what we can create as a team! Let's make it memorable! 🎵✨\nLiHua: It's gonna be an unforgettable night for sure! Can't wait to see everyone! 🎉\nWolfgangSchulz: It's great to see everyone so pumped for tomorrow! Let's make some awesome music together! 🎤🎶\nWolfgangSchulz: Looking forward to jamming with everyone! Let's bring our ideas to life! 🎉\nLiHua: This is going to be epic! See you all soon! 🎸✨\nWolfgangSchulz: Can't wait, everyone! Let's light up that basement with our creativity! \nYurikoYamamoto: So excited to get started! It's going to be a night to remember! 🎶✨\nChaeSong-hwa: Let’s make sure to have everything ready for practice tomorrow! I’m bringing my lyrics notebook! \nWolfgangSchulz: I’ll make sure to bring my ideas too! Let’s be ready to dive in! \nChaeSong-hwa: Remember to bring your instruments! It'll be a great session to kick off our new projects! 🎸🎤\nChaeSong-hwa: I hope everyone is feeling inspired for tomorrow! It’s going to be a creative journey! 🌟\nYurikoYamamoto: Can’t wait to see what everyone brings to the table! Let's make it special! 🎶\nWolfgangSchulz: This is going to be legendary! Let's get together and unleash our creativity! \nChaeSong-hwa: So pumped for tomorrow! It's going to be a blast! Let’s show our creative sides! 🌈\nYurikoYamamoto: I hope everyone has fun brainstorming ideas! It’ll be nice to explore our original sounds together! 🌟\nYurikoYamamoto: Let’s embrace our creativity and make something beautiful! It's going to be an amazing night! 🎶",
    "content_summary": "Time: 20260801_15:00\nWolfgangSchulz: Hey everyone! 🎵 What do you think about including some original...",
    "content_length": 3003,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week30\\20260801_1500.txt",
    "metadata": {
      "id": "doc_31",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week30\\20260801_1500.txt"
    },
    "created_at": "2025-09-01T17:01:42.490341",
    "updated_at": "2025-09-01T17:01:42.560408"
  },
  "doc-d101989107d2d6e198c4af2131e5543e": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260304_09:45\nAdamSmith: Just wanted to remind you about the community garden cleanup event this Saturday. Are you able to bring any gardening tools along?\nLiHua: Thanks for the reminder! I'm not sure I can make it this time, so I won’t bring any tools.\nAdamSmith: No worries! If you change your mind or need help with anything, just let me know. Hope you can join us in the future!\nLiHua: Sure thing! I appreciate it. I hope it goes well!\nAdamSmith: Thanks! We're looking forward to it. Enjoy your week!",
    "content_summary": "Time: 20260304_09:45\nAdamSmith: Just wanted to remind you about the community garden cleanup event t...",
    "content_length": 511,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week9\\20260304_0945.txt",
    "metadata": {
      "id": "doc_32",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week9\\20260304_0945.txt"
    },
    "created_at": "2025-09-01T17:01:46.702966",
    "updated_at": "2025-09-01T17:01:46.722057"
  },
  "doc-d9c7ebecedb84ef1ee09025f19f460af": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260912_16:00\nLiHua: Hey Jake! Just want to ask your opinion about the best midfielder in the past decade since you're such an experienced soccer fan!\nJakeWatson: Oh, I think it’s gotta be Luka Modrić! His vision and passing ability are just unreal. Plus, he helped Croatia reach the finals in the World Cup! What do you think?\nLiHua: Yeah, Modrić is a beast! But I think Kevin De Bruyne is right up there too. His ability to create chances and his pinpoint passes are game-changing. It's tough to choose just one!\nJakeWatson: Absolutely! De Bruyne is incredible as well. He's such a game-changer for City too. It’s awesome watching him play. Who else do you think deserves a mention in that conversation?\nLiHua: N'Golo Kanté can't be overlooked either! He's all over the pitch, winning tackles and breaking up play. His work rate is phenomenal, and he’s been key for Chelsea and the French national team. \nJakeWatson: Totally agree! Kanté brings so much energy and balance to the midfield. His ability to win the ball back is impressive. It’s interesting how different styles can impact a game!",
    "content_summary": "Time: 20260912_16:00\nLiHua: Hey Jake! Just want to ask your opinion about the best midfielder in the...",
    "content_length": 1102,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week36\\20260912_1600.txt",
    "metadata": {
      "id": "doc_33",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week36\\20260912_1600.txt"
    },
    "created_at": "2025-09-01T17:01:50.989414",
    "updated_at": "2025-09-01T17:01:51.018996"
  },
  "doc-ffe1a022ad744b0ce6a51ada74dc12bb": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260602_10:00\nLiHua: Hi Adam, just wanted to let you know that I've transferred the rent. Sorry for the delay!\nAdamSmith: Thanks for the update! No worries about the late payment. Hope everything is good with you.\nLiHua: Everything's good, just getting used to the renovations outside. How’s your day going?\nAdamSmith: It's going well, thanks! Just busy with work as usual. How about you?\nLiHua: I've been working from the café due to the noise, but it's nice and peaceful there. Just focusing on my projects.",
    "content_summary": "Time: 20260602_10:00\nLiHua: Hi Adam, just wanted to let you know that I've transferred the rent. Sor...",
    "content_length": 516,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week22\\20260602_1000.txt",
    "metadata": {
      "id": "doc_34",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week22\\20260602_1000.txt"
    },
    "created_at": "2025-09-01T17:01:55.363553",
    "updated_at": "2025-09-01T17:01:55.385124"
  },
  "doc-1ac948071c658327f6ec4955eeae9739": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260415_08:08\nAlice: I am Alice from Hailey's bakery. Your bread has been delivered, please come and pick it up ASAP. Have a good day : )",
    "content_summary": "Time: 20260415_08:08\nAlice: I am Alice from Hailey's bakery. Your bread has been delivered, please c...",
    "content_length": 144,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\bakery_deliver\\20260415.txt",
    "metadata": {
      "id": "doc_35",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\bakery_deliver\\20260415.txt"
    },
    "created_at": "2025-09-01T17:01:59.830329",
    "updated_at": "2025-09-01T17:01:59.843388"
  },
  "doc-6cfebb1294ec155a99d86bb5e72c79e1": {
    "status": "processed",
    "chunks_count": 10,
    "content": "Time: 20261225_15:00\nThaneChambers: Hey everyone! Just wanna ask you guys what are some games with stunning visuals in your mind?\nLiHua: I’d say \"Ghost of Tsushima\" definitely deserves a mention. The visuals are just breathtaking, especially during those epic samurai duels! What do you all think?\nCaelum: Totally agree! That game's landscapes are like painting, especially the cherry blossoms. Have you all tried taking pictures in photo mode? It's so fun!\nAisling: \"Final Fantasy VII Remake\" is another one I love for visuals. The Midgar section is so detailed and vibrant, it really pulls you into the world! Anyone else felt the same?\nCaelum: For sure! The lighting in \"Final Fantasy VII Remake\" is amazing, particularly in the slums! I love how they’ve made the city feel alive. Have any of you noticed the little details in the background?\nCaelum: I think \"Horizon Forbidden West\" looks stunning too. The way the machines blend into nature is just incredible. The graphics make exploring so much more immersive! What do you all think about that?\nElara: Totally! \"Horizon Forbidden West\" has so much detail in the environments. I love how the different biomes look, from the deserts to the forests. Every area feels unique and alive! Plus, the character animations are super smooth too!\nDyllan: I’m really impressed by \"Ratchet & Clank: Rift Apart\" as well! The way they use dimensional rifts really brings those visuals to life. It's seriously like watching an animated movie! Anyone else blown away by the graphics?\nThaneChambers: \"Spider-Man: Miles Morales\" also nails the visuals with its art style! Swinging through the city at sunset with all those neon lights is just a treat for the eyes. What are your thoughts on that?\nGavriel: Oh, I loved that too! The way the city lights up at night is stunning. Plus, the snow effects really add to the atmosphere. It feels so alive! Did you guys enjoy the story as much as the graphics?\nBronwyn: \"Resident Evil Village\" has some jaw-dropping visuals too! The Gothic architecture and creepy atmosphere really pulled me in. Exploring Castle Dimitrescu was exhilarating! Have any of you faced that creepy encounter with the Lady herself?\nThaneChambers: For sure! The level of detail in \"Resident Evil Village\" is impressive. The tension is real when you’re wandering around those creepy old hallways. Plus, the character models are super realistic! What a delivery by the team!\nLiHua: I’d also throw in \"Assassin's Creed Valhalla\"! The landscapes of Norway and England are breathtaking! The attention to detail in the historical settings really lets you feel like a true Viking!\nJareth: Exactly! \"Assassin's Creed Valhalla\" captures the vastness of those landscapes so well. I really felt immersed wandering through the valleys and forests. Plus, the weather effects add a lot to the experience too!\nCaelum: So true! The dynamic weather and time of day shift in \"Assassin's Creed Valhalla\" makes every exploration feel unique. I love returning to places at different times to see how everything changes! Anyone else felt the same?\nAisling: \"Returnal\" definitely has stunning visuals too! The alien landscapes are so surreal and otherworldly. The use of colors and shadows makes each biome feel unique and incredibly atmospheric! What’s everyone’s take on that?\nHelios: Yeah, the way \"Returnal\" combines graphics with gameplay is amazing! Each area feels like a puzzle just waiting to be solved, and the visuals really enhance that eerie vibe. It’s definitely a game that sticks with you!\nHelios: Absolutely! The visual storytelling in \"Returnal\" is top-notch, and the constant atmosphere shift really keeps the tension high. Quite the ride, for sure! Anyone else find the art style mesmerizing?\nDyllan: The art style is mind-blowing for sure! The contrast between the vibrant alien flora and the darker elements of the environments really captures attention. Plus, the effects during combat make everything feel even more intense!\nElara: It’s amazing how \"Returnal\" keeps you on your toes with its visuals and mechanics! I really felt the tension build as you navigate through those gorgeous, yet deadly landscapes. Each death feels like a well-crafted experience all over again!\nElara: The visual design of \"Death Stranding\" is also really impressive! The way landscapes shift from serene to desolate really gives a sense of scale. Not to mention how the lighting changes depending on the weather! What do you all think?\nAisling: Yeah, \"Death Stranding\" doesn't disappoint with visuals! The vast open world is stunning, and those rain effects are crazy realistic! Walking through the different terrains really immerses you into the journey. Have you guys explored all the areas?\nAisling: I’ve taken my time exploring every nook and cranny in \"Death Stranding\"! The environments really make you want to savor the experience. It's strangely peaceful, even with all the challenges! Anyone else enjoy just wandering around?\nIleana: It's such a unique experience, right? The visuals create a meditative vibe while playing. I find myself getting lost in the landscapes, just taking it all in. It’s an emotional journey alongside the breathtaking scenes!\nIleana: I totally feel that! The music and ambiance really complement the visuals too. It adds to that meditative feeling while you’re wandering. It’s like each step is part of a larger story unfolding in front of you.\nBronwyn: For sure! Each setting in \"Death Stranding\" has its own character and vibe, which really adds to the experience. I love how even the smallest details contribute to the overall story! Have you all had any memorable moments while exploring?\nIleana: I’ve had so many unexpected encounters that really added to the experience! The first time I stumbled upon a hidden area was such a thrill, and the visuals made it feel even more special. Those moments just stick with you! How about you? Any cool finds?\nDyllan: I found this amazing cliffside view when I was trying to avoid a BT area. The sunset merged with the scenery so perfectly; it felt like I was in a dream! It’s moments like those that make the game so memorable!\nElara: That's awesome! Finding those hidden spots can really make the journey worthwhile. The visuals and ambiance really transform the moment into something special. Have you all had a favorite area you've discovered?\nGavriel: Honestly, the mountain regions had me in awe! The snow effects were so realistic, and when the sun started to rise, it transformed the entire landscape! It made every trek feel rewarding. Anyone else have a favorite zone in there?\nAisling: The forest areas are my favorite! The way the fog rolls in and the lighting filters through the trees creates such a mysterious atmosphere. It’s tranquil yet eerie at the same time! What’s your take on those vibes?\nAisling: The forest areas have that beautiful contrast in \"Death Stranding\" for sure! It really plays with your emotions. The way the light hits those trees and the sound design adds to that eerie comfort! It's like you can't help but feel connected to the world. Anyone else agree?\nFionnuala: I'm all in on that! The sounds in those forested areas really pull you in, especially with the rain and nature sounds. It's such a surreal combo, making those areas feel alive. It's like the game itself is telling a story through its visuals and sounds!\nThaneChambers: Absolutely! The sound design enhances those dreamy landscapes by making them feel even more immersive. I love how every detail contributes to that intense emotional connection while wandering the world. It's a wild ride!\nIleana: It's amazing how much the visuals and sound can impact our experience, isn't it? The way they come together creates such emotional storytelling. Every moment feels like it's meant to be savored!\nThaneChambers: Totally! It's like each game is not just a playthrough but an experience to remember. The combination of visuals, sound, and story can stick with us long after we put the controller down!  What games left a lasting impact on you all?\nThaneChambers: I think \"The Last of Us Part II\" hit me hard in so many ways! The storytelling paired with those graphics made every moment feel raw and real. It definitely left me reflecting for days. How about you all?",
    "content_summary": "Time: 20261225_15:00\nThaneChambers: Hey everyone! Just wanna ask you guys what are some games with s...",
    "content_length": 8285,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week51\\20261225_1500.txt",
    "metadata": {
      "id": "doc_36",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week51\\20261225_1500.txt"
    },
    "created_at": "2025-09-01T17:02:04.497822",
    "updated_at": "2025-09-01T17:02:04.648502"
  },
  "doc-be0c260d780ca6bec36ea71a3cba2a46": {
    "status": "processed",
    "chunks_count": 3,
    "content": "Time: 20260416_21:00\nWolfgangSchulz: Hey guys, how about we take a break from jamming this week? Could use some time to recharge! \nWolfgangSchulz: Let’s plan for next Sunday instead, yeah? Got some cool ideas for our next session! 🎶\nYurikoYamamoto: Sounds good to me! I'm looking forward to our next jam session. Let's brainstorm some new songs to play! 🎸\nLiHua: Yeah, I'm excited too! We can share ideas and come up with something fun for next time. Enjoy the break, everyone!\nYurikoYamamoto: Definitely! It’ll be nice to think about fresh tunes. Enjoy the week, everyone! 🌟\nWolfgangSchulz: Yeah, definitely need that time to think about new music! See you both next Sunday! 🎤🎶\nWolfgangSchulz: Hope you both have a chill week! Catch you later!\nLiHua: Take care, guys! Looking forward to next Sunday! 🎉\nLiHua: Have a great week, everyone! Don't forget to keep your guitars handy! 🎸\nYurikoYamamoto: I'll be ready with my bass! Can't wait to play again next week! 🎶\nWolfgangSchulz: Sounds like a plan! I'll be itching to play some new beats! See you!\nYurikoYamamoto: Bye for now! Can't wait for our next jam. 😊🎵\nWolfgangSchulz: Catch you later! Enjoy your week, both!\nLiHua: See you both later! Have fun and stay inspired! 🌈\nYurikoYamamoto: 💖\nLiHua: Take care, everyone! Let's keep the energy up for next week! 🎶\nWolfgangSchulz: Bye, everyone! Remember to stay creative!\nWolfgangSchulz: Guys, keep sharing your song ideas in the chat! It'll be fun to see what we come up with! 🎸\nYurikoYamamoto: I'll think of some songs too and share! Excited to see everyone's suggestions! 🌟\nLiHua: Yes! Let’s make a great playlist for next week! I’ll throw in some ideas too! 🎶\nLiHua: Can’t wait to see what everyone comes up with! It’s gonna be awesome! 😄",
    "content_summary": "Time: 20260416_21:00\nWolfgangSchulz: Hey guys, how about we take a break from jamming this week? Cou...",
    "content_length": 1739,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week15\\20260416_2100.txt",
    "metadata": {
      "id": "doc_37",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week15\\20260416_2100.txt"
    },
    "created_at": "2025-09-01T17:02:09.572607",
    "updated_at": "2025-09-01T17:02:09.624303"
  },
  "doc-5f94be807188c2186e7ce59b78e6c4a4": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260302_18:45\nAdamSmith: Hey Li Hua! There’s a neighborhood potluck dinner on Wednesday at 6 PM. Would you like to bring a dish to share? It'll be a great way to meet some neighbors!\nLiHua: Hey Adam! That sounds awesome! I'd love to contribute. I can whip up some homemade pasta salad. Does that work for you?\nAdamSmith: That sounds delicious! I'm sure everyone will enjoy it. Do you need any kitchen supplies or anything from my side?\nLiHua: Thanks, Adam! I think I have everything I need. Just need to pick up some fresh ingredients tomorrow. Really looking forward to the potluck!\nAdamSmith: Great to hear! I’m looking forward to it too. Let me know if you need any help. Enjoy making the salad!\nLiHua: Will do! Thanks for the offer, Adam! See you on Wednesday! 🌟",
    "content_summary": "Time: 20260302_18:45\nAdamSmith: Hey Li Hua! There’s a neighborhood potluck dinner on Wednesday at 6 ...",
    "content_length": 773,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week9\\20260302_1845.txt",
    "metadata": {
      "id": "doc_38",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week9\\20260302_1845.txt"
    },
    "created_at": "2025-09-01T17:02:14.729340",
    "updated_at": "2025-09-01T17:02:14.757932"
  },
  "doc-22ae76190feb982a5ec8810c08250f60": {
    "status": "processed",
    "chunks_count": 5,
    "content": "Time: 20260908_21:00\nChaeSong-hwa: Hey everyone! I’ve been thinking it’d be cool to explore fusion music! How about we try mixing jazz elements with rock? It could add a whole new vibe to our sound! 🎶 What do you all think?\nWolfgangSchulz: That sounds like a fun idea! Jazz and rock can create some really unique rhythms. Let's experiment with different styles this Sunday and see what we come up with!\nYurikoYamamoto: Totally agree! Mixing those genres could bring out some amazing creativity. We could start with a classic rock song and add some jazz chords or improvisation. It'll be fun! 🎸🥁✨\nWolfgangSchulz: Yeah, let's see what we can blend together! I'm excited to jam and figure out some cool transitions. I bet it will take our music to a whole new level. Can't wait for Sunday! 😄🎵\nWolfgangSchulz: Let’s also think about which songs we could try that would work well with jazz elements. Any suggestions?\nYurikoYamamoto: How about we start with a rock classic like \"Smoke on the Water\" or \"Back in Black\"? We could reimagine them with a jazzy twist, maybe throw in some improvisation too! What do you think?\nYurikoYamamoto: Those are great picks! We could add some swing to the rhythm and see how it feels. I can already imagine us jamming to those with added jazz elements! 🎷🎸\nWolfgangSchulz: Sounds like a plan! Let’s finalize our songs on Sunday. Looking forward to the new vibe! 🎶🔥\nWolfgangSchulz: Also, if you come up with any other tracks to mix in, just send them over! The more ideas, the better!\nLiHua: I'll keep brainstorming and share any new ideas! This fusion concept is going to be awesome! 🎶🎉\nChaeSong-hwa: Can't wait to see what we come up with together! Fusion music is all about creativity, and I’m sure we’ll have a blast experimenting with it! \nLiHua: For sure! Here's to an exciting musical journey ahead – it's going to be epic! 🎸✨\nChaeSong-hwa: I'm super excited too! Let’s bring that energy on Sunday and make some magic happen. 😄🎶\nLiHua: Let's do it! I'm looking forward to our jam session! 🎶😊\nLiHua: If anyone has any specific jazz techniques or elements they’ve been wanting to try, feel free to share! It’d be great to spark some ideas!\nWolfgangSchulz: Definitely! I'll look into some jazz drumming techniques to incorporate. Let's make it interesting! 🥁✨\nWolfgangSchulz: Looking forward to sharing ideas and creating something unique together! It's going to be a fun challenge! 🎶😊\nLiHua: Absolutely! It's all about collaboration and having fun with our sound. Let’s experiment and see where this takes us! 🎉🎸\nYurikoYamamoto: I'm sure our jam will be filled with surprises! It's always refreshing to dive into new styles together. Can't wait for Sunday! 🎵✨\nWolfgangSchulz: Let's make the most of our time together! It's always good to explore new musical worlds! See you all Sunday! 🎶🤘\nWolfgangSchulz: Don’t forget to bring some of those jazz ideas and vibes! It's going to be a blast mixing it up!\nYurikoYamamoto: I'm ready to bring my bass and dive into some jazz and rock fusion! It’s going to be a fun challenge! 🌟🎸\nLiHua: Let's make this a memorable session! I'm really excited for what we'll create together! 🎶🎉\nWolfgangSchulz: Can’t wait to hear what we all come up with! It'll be a great night for sure! 😄🎵\nChaeSong-hwa: It's going to be a fantastic session! Let's bring our A-game and have the best time! 🎤🎶\nChaeSong-hwa: Let’s keep the energy up and make it an unforgettable night of music! 😊🎸\nLiHua: Absolutely! Let’s channel all that excitement into our music and have a great time! 🎶✨\nWolfgangSchulz: Hope everyone brings their best vibe on Sunday! It'll be legendary! 🎉🎵",
    "content_summary": "Time: 20260908_21:00\nChaeSong-hwa: Hey everyone! I’ve been thinking it’d be cool to explore fusion m...",
    "content_length": 3619,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week36\\20260908_2100.txt",
    "metadata": {
      "id": "doc_39",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week36\\20260908_2100.txt"
    },
    "created_at": "2025-09-01T17:02:19.928919",
    "updated_at": "2025-09-01T17:02:20.020873"
  },
  "doc-2b2d253be2854961cd4b3f4c6ece96a0": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20261017_17:00\nLiHua: Hey bro! Quick question for ya: What kind of pizza is your favorite?\nWolfgangSchulz: Bro, I’m all about that classic margherita. Simple but so good! What about you?\nLiHua: I’m a big fan of pepperoni, can’t resist that spiciness! Plus, a little extra cheese always hits the spot. 🍕 What do you like to pair with it?\nWolfgangSchulz: I usually go for a nice cold drink, maybe a soda or even some craft beer if I'm in the mood. Perfect combo! What’s your drink of choice?\nLiHua: I love having a refreshing lemonade with pizza. It complements the flavors so well! Do you have any favorite places for pizza around here?\nWolfgangSchulz: There’s that new place downtown I’ve been hearing good things about. We should definitely check it out sometime!\nLiHua: For sure! Let’s plan a pizza night soon. It’ll be great to try some new flavors together! 🍕✨",
    "content_summary": "Time: 20261017_17:00\nLiHua: Hey bro! Quick question for ya: What kind of pizza is your favorite?\nWol...",
    "content_length": 870,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week41\\20261017_1700.txt",
    "metadata": {
      "id": "doc_40",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week41\\20261017_1700.txt"
    },
    "created_at": "2025-09-01T17:02:25.405899",
    "updated_at": "2025-09-01T17:02:25.433363"
  },
  "doc-17f71c867e987d225f99b49541f69dfe": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20261027_17:00\nLiHua: Hey Adam! I just wanted to say a big thank you for being such a supportive landlord. I’m planning to send you a fruit basket as a little token of my appreciation. Hope it brings some extra sweetness to your day! 🍎🍍🍌\nAdamSmith: That's really thoughtful of you! I appreciate it a lot. It’s been great having you as a tenant. Let me know if you need any help with the delivery. 😊\nLiHua: No worries, I’ll sort it out! Just wanted you to know how much I value all you've done. Enjoy the fruits when they arrive! 🍊🍇",
    "content_summary": "Time: 20261027_17:00\nLiHua: Hey Adam! I just wanted to say a big thank you for being such a supporti...",
    "content_length": 537,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week43\\20261027_1700.txt",
    "metadata": {
      "id": "doc_41",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week43\\20261027_1700.txt"
    },
    "created_at": "2025-09-01T17:02:30.885032",
    "updated_at": "2025-09-01T17:02:30.905580"
  },
  "doc-4113f19866760f75312054140a50f4c2": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260211_17:00\nLiHua: Hey! Just finished a project, so I’m thinking of treating myself to a guitar! 🎸 Are you still jamming on the drums?\nWolfgangSchulz: Nice to hear you're getting a guitar! I haven't played the drums in ages, work's been super busy. But I still love music! \nLiHua: That's cool! Music is such a great outlet, especially when life gets hectic. Do you still have your old kit? Maybe we can have a jam session together sometime!\nWolfgangSchulz: Yeah, I've kept my old kit. A jam session sounds fun! It would be nice to get back into it, even if just for a bit. Let’s plan something for the weekend!\nLiHua: Sounds like a plan! I can't wait to let loose and make some music together. 🎶 Let me know what time works for you!\nWolfgangSchulz: For sure! I’ll check my schedule and let you know. Looking forward to it!",
    "content_summary": "Time: 20260211_17:00\nLiHua: Hey! Just finished a project, so I’m thinking of treating myself to a gu...",
    "content_length": 831,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week6\\20260211_1700.txt",
    "metadata": {
      "id": "doc_42",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week6\\20260211_1700.txt"
    },
    "created_at": "2025-09-01T17:02:36.414052",
    "updated_at": "2025-09-01T17:02:36.439316"
  },
  "doc-e49eb3d3c6ae622405b4766b44409131": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260330_18:00\nAdamSmith: Hey Li Hua, just a quick reminder that rent is due soon. Let me know if you need any details!\nLiHua: Thanks for the reminder, Adam! I'll get it sorted out soon. Hope you're having a great day!\nAdamSmith: No problem! If you need anything or have questions, just reach out. Have a good one!\nLiHua: Will do, Adam! Appreciate it. Catch you later!",
    "content_summary": "Time: 20260330_18:00\nAdamSmith: Hey Li Hua, just a quick reminder that rent is due soon. Let me know...",
    "content_length": 374,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week13\\20260330_1800.txt",
    "metadata": {
      "id": "doc_43",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week13\\20260330_1800.txt"
    },
    "created_at": "2025-09-01T17:02:41.979073",
    "updated_at": "2025-09-01T17:02:41.997991"
  },
  "doc-2faa2d345fd8d9b1f5a76bc07074cf30": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20261105_15:00\nJakeWatson: Hey Li Hua! I remember you are kind of confused about the rules of offsides last time. So let me explain it to you.\nJakeWatson: So, about offsides – it's basically when an attacking player is ahead of the last defender (excluding the goalie) at the moment the ball is passed to them. It can be a bit tricky, but it helps keep the game fair and exciting. Can't wait to show you this stuff on the field! ⚽️\nLiHua: Totally get it! Offside can really change the game flow! Looking forward to practicing together. Let’s see how it goes on the field! ⚽️💪\nJakeWatson: Exactly! It’s all about timing and positioning. We’ll have a blast practicing! Just let me know when you're free and we can hit the field. Ready to kick some goals! ⚽😄\nLiHua: Sounds good! I’ll check my schedule and let you know when I'm available. Can't wait to get out there and play! 🥅⚽️\nJakeWatson: Awesome! Just hit me up whenever. It's gonna be fun introducing you to more soccer tactics while having a good time. Let's keep this energy going! ⚡️⚽️",
    "content_summary": "Time: 20261105_15:00\nJakeWatson: Hey Li Hua! I remember you are kind of confused about the rules of ...",
    "content_length": 1047,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week44\\20261105_1500.txt",
    "metadata": {
      "id": "doc_44",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week44\\20261105_1500.txt"
    },
    "created_at": "2025-09-01T17:02:47.864441",
    "updated_at": "2025-09-01T17:02:47.893643"
  },
  "doc-f8690e6a6ba9a51269dd445b9931132e": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20261220_20:00\nWolfgangSchulz: Hey! I’ve been looking into some techniques for taking stunning photos. Got any tips? I’m heading to Hong Kong soon and want to capture some beautiful shots! 😊📸\nLiHua: Oh, that sounds awesome! For taking great photos, try experimenting with the golden hour for the best lighting—sunrise or sunset can work wonders! Also, don’t forget to compose your shots with leading lines to draw the viewer's eye. Have fun and shoot a ton!\nWolfgangSchulz: Thanks for the tips! I'll definitely aim for the golden hour. Anything else I should keep in mind while I’m shooting? 🎨🖼️\nLiHua: Make sure to play with different angles! Getting low or high can really change the mood of your shots. Also, don’t hesitate to include some locals or unique elements in your frame—it can add a lot of life to your photos! Enjoy the adventure!\nWolfgangSchulz: Great advice! I’ll try to capture the vibe of the place and the locals. Can't wait to show you the photos! 🌆✨\nLiHua: I can't wait to see them! You'll have an amazing time in Hong Kong. Let me know if you need more tips!",
    "content_summary": "Time: 20261220_20:00\nWolfgangSchulz: Hey! I’ve been looking into some techniques for taking stunning...",
    "content_length": 1086,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week50\\20261220_2000.txt",
    "metadata": {
      "id": "doc_45",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week50\\20261220_2000.txt"
    },
    "created_at": "2025-09-01T17:02:53.553006",
    "updated_at": "2025-09-01T17:02:53.582582"
  },
  "doc-23f872f4fa7482df87ddbee7f9a32c14": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260625_20:00\nAdamSmith: Hey, Li Hua! Just wanted to let you know that we'll be doing some necessary repairs in the basement soon. Hope it won’t cause you too much inconvenience. Let me know if you have any concerns!\nLiHua: Thanks for the heads up! I appreciate it. Just hope it won't mess with our jam sessions. Let me know when the repairs are happening!\nAdamSmith: Got it! I’ll keep you posted on the schedule for the repairs. Should be straightforward, but I'll make sure to minimize any disruption. \nLiHua: Sounds good! Thanks for being considerate. Can’t wait to hear more updates about it! \nAdamSmith: No problem! Your comfort is important. I’ll update you as soon as I have a timeline for the repairs. \nLiHua: Appreciate it! Looking forward to jamming with the band this Sunday! \nAdamSmith: That sounds awesome! Hope you all have a great time! Let me know how it goes. \nLiHua: Will do! Thanks again!",
    "content_summary": "Time: 20260625_20:00\nAdamSmith: Hey, Li Hua! Just wanted to let you know that we'll be doing some ne...",
    "content_length": 914,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week25\\20260625_2000.txt",
    "metadata": {
      "id": "doc_46",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week25\\20260625_2000.txt"
    },
    "created_at": "2025-09-01T17:02:59.321487",
    "updated_at": "2025-09-01T17:02:59.349063"
  },
  "doc-c9539aee92795f743707e33f2fed23bf": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260106_15:00\nAdamSmith: Hey Li Hua, just wanted to confirm that the plumber will be arriving tomorrow at 10 AM to fix the water tap. Let me know if that works for you!\nLiHua: Sounds good to me! I'll be ready for him. Thanks for taking care of that!\nAdamSmith: Great! If you need anything else or have questions, just let me know.\nLiHua: Will do! Appreciate it!",
    "content_summary": "Time: 20260106_15:00\nAdamSmith: Hey Li Hua, just wanted to confirm that the plumber will be arriving...",
    "content_length": 368,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week1\\20260106_1500.txt",
    "metadata": {
      "id": "doc_47",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week1\\20260106_1500.txt"
    },
    "created_at": "2025-09-01T17:03:05.137818",
    "updated_at": "2025-09-01T17:03:05.155440"
  },
  "doc-787f174c3d57a6fcf6fa575a911d3a3d": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260318_15:30\nLiHua: Hey! What do you think about playing \"Wonderwall\" this Sunday? I feel like it would be a fun jam! 🎸\nWolfgangSchulz: \"Wonderwall\" sounds great! It’ll be awesome to groove to that one together. How about mixing it up with “Hey Jude” too?\nLiHua: \"Hey Jude\" is a classic! I love that idea. We could really get into it and have a good time. Any other songs you're thinking about?\nWolfgangSchulz: How about we throw in \"Come Together\" as well? I think it would be a nice addition to our set! 🥁\nLiHua: \"Come Together\" would definitely add some cool vibes! I'm all in for that. Let’s make this Sunday a blast! 🎶\nWolfgangSchulz: Can't wait! It’s gonna be a fun night. Let’s nail down the parts we want to focus on before then. 🎤\nLiHua: Good plan! We can go over the key parts and figure out our roles. It’ll make the practice smoother. See you Sunday! 🎸🙌",
    "content_summary": "Time: 20260318_15:30\nLiHua: Hey! What do you think about playing \"Wonderwall\" this Sunday? I feel li...",
    "content_length": 873,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week11\\20260318_1530.txt",
    "metadata": {
      "id": "doc_48",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week11\\20260318_1530.txt"
    },
    "created_at": "2025-09-01T17:03:11.127454",
    "updated_at": "2025-09-01T17:03:11.156515"
  },
  "doc-030e7922e28d9898acc0ca282447383f": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260619_08:15\nJenniferMoore: Hey Li Hua! Just wanted to let you know there’s a special guest speaker talking about nutrition for athletes soon. Are you interested in joining? 🥦💪\nLiHua: Sounds cool! I'm definitely interested in learning more about nutrition. When’s the talk?\nJenniferMoore: Awesome! The talk is next Wednesday at 6 PM. It’ll cover some great tips for performance and recovery. Would you like me to reserve a spot for you? 🌟\nLiHua: Yes, please reserve a spot for me! Excited to hear all about it! 😊\nJenniferMoore: Got it! You’re all signed up for the talk. Can’t wait to see you there! 🌟 If you have any questions before then, just let me know! \nLiHua: Thanks! I appreciate it. Looking forward to it!",
    "content_summary": "Time: 20260619_08:15\nJenniferMoore: Hey Li Hua! Just wanted to let you know there’s a special guest ...",
    "content_length": 722,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week24\\20260619_0815.txt",
    "metadata": {
      "id": "doc_49",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week24\\20260619_0815.txt"
    },
    "created_at": "2025-09-01T17:03:17.390794",
    "updated_at": "2025-09-01T17:03:17.415851"
  },
  "doc-0313e2c91a4a0e1c33318eee9a11fb8c": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260511_11:00\nWolfgangSchulz: Hey! Just wanted to let you know there's a web design seminar at my company this week. It could be interesting for you. Want to join me?\nLiHua: Sounds awesome! I'd love to join. When is it happening?\nWolfgangSchulz: It's on Thursday at 3 PM. Should be pretty insightful! Let me know if you can make it.\nLiHua: Perfect! I'll be there. Looking forward to it!\nWolfgangSchulz: Great! It's gonna be fun. We can grab a coffee afterward too.",
    "content_summary": "Time: 20260511_11:00\nWolfgangSchulz: Hey! Just wanted to let you know there's a web design seminar a...",
    "content_length": 471,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week19\\20260511_1100.txt",
    "metadata": {
      "id": "doc_50",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week19\\20260511_1100.txt"
    },
    "created_at": "2025-09-01T17:03:23.623310",
    "updated_at": "2025-09-01T17:03:23.643351"
  },
  "doc-7b668087d29a689084cfb2648f9fb02d": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260122_15:00\nLiHua: Hey Jennifer! Just wanted to say thank you for the new meal plan! I'm loving the variety so far, but I feel like I need a bit more protein for my workouts. Could we adjust that? Also, maybe a few more snack options? Thanks!\nJenniferMoore: Awesome to hear you’re enjoying it! Let's definitely boost that protein. How about we add some lean meats or protein-rich snacks? I can suggest some options for you too. And I’ll include a few more snack ideas in the plan. You’ve got this! 💪✨\nLiHua: That sounds perfect! I'm all in for some lean meats and new snack ideas. Just let me know what you suggest! Thanks again for your help! 😊\nJenniferMoore: Sure thing! I'll send you a list of some yummy lean meats like chicken, turkey, and fish. For snacks, how about Greek yogurt, mixed nuts, or protein bars? Let me know if you want any specific recipes or ideas for meals! 🍽️💖\nLiHua: I love those snack ideas! Greek yogurt and mixed nuts are definitely my vibe. Can you send over a couple of quick recipes using those? Appreciate it! 😄\nJenniferMoore: Absolutely! For Greek yogurt, try mixing it with some fresh berries and a drizzle of honey for a tasty snack. For mixed nuts, you can create a trail mix with dried fruit and a sprinkle of dark chocolate for a sweet touch. Let me know if you need anything else! 🍇🍫\nLiHua: Those recipes sound delicious! Can't wait to try them out. Thanks for being so helpful! You're the best! 🙌\nJenniferMoore: So glad you like them! Keep up the great work, and let me know how everything goes! You've got this! 💪✨",
    "content_summary": "Time: 20260122_15:00\nLiHua: Hey Jennifer! Just wanted to say thank you for the new meal plan! I'm lo...",
    "content_length": 1564,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week3\\20260122_1500.txt",
    "metadata": {
      "id": "doc_51",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week3\\20260122_1500.txt"
    },
    "created_at": "2025-09-01T17:03:29.898555",
    "updated_at": "2025-09-01T17:03:29.935690"
  },
  "doc-594e6f0c159ce67ebfdcad157b160d84": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260123_17:00\nWolfgangSchulz: Hey! How about grabbing some dinner tonight? I know a nice place we could check out!\nLiHua: Hey! Thanks for the invite, but I've been super busy lately. Let's plan for another day?\nWolfgangSchulz: No problem, I totally understand. Just let me know when you're free! Want to do something low-key this weekend, maybe?\nLiHua: Yeah, for sure! A chill weekend sounds great. Maybe we can catch a movie or just hang out at a cafe? What do you think?\nWolfgangSchulz: That sounds perfect! A movie or just chilling at a cafe would be awesome. We can figure out the details later!",
    "content_summary": "Time: 20260123_17:00\nWolfgangSchulz: Hey! How about grabbing some dinner tonight? I know a nice plac...",
    "content_length": 606,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week3\\20260123_1700.txt",
    "metadata": {
      "id": "doc_52",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week3\\20260123_1700.txt"
    },
    "created_at": "2025-09-01T17:03:36.091916",
    "updated_at": "2025-09-01T17:03:36.113941"
  },
  "doc-af34d31cf0c3dd062976e0f2281bdaa7": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260426_10:00\nAdamSmith: Hey Li Hua! Are you interested in joining our group chat for the garden renovation activities? It'd be a good way to discuss the details with the admin and others involved. Let me know!\nLiHua: Sure, I’d love to join the group chat! Sounds like a fun project. Just let me know when it’s set up!\nAdamSmith: Great! I’ll add you to the group as soon as it's ready. Looking forward to seeing your ideas!\nLiHua: Thanks! I'm excited to share some thoughts on the garden. Can't wait to get started!\nAdamSmith: No problem! I think it'll be a fun project for all of us. We can really make the garden nice together!\nLiHua: Absolutely! Collaborating with everyone will make it even better. I’m looking forward to seeing what we can come up with!\nAdamSmith: Let’s make it a space we all enjoy! I’ll keep you posted on when we get the group chat going.\nLiHua: Sounds good! Just give me a shout when it's up. Looking forward to it!",
    "content_summary": "Time: 20260426_10:00\nAdamSmith: Hey Li Hua! Are you interested in joining our group chat for the gar...",
    "content_length": 948,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week16\\20260426_1000.txt",
    "metadata": {
      "id": "doc_53",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week16\\20260426_1000.txt"
    },
    "created_at": "2025-09-01T17:03:42.360749",
    "updated_at": "2025-09-01T17:03:42.386495"
  },
  "doc-61cbcd04446d68ae6a96f90bb0abaf85": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260622_13:30\nHaileyJohnson: Hey Li Hua! 😊 Just wanted to invite you to a special event at the bakery this Saturday! We're launching a new line of healthy bread options, and I’d love for you to check it out. It'll be a fun tasting session! Let me know if you can make it! 🍞❤️\nLiHua: Sounds amazing! I’m definitely in for the tasting session! Can’t wait to try the new healthy options. What time does it start? 🍞✨\nHaileyJohnson: Awesome! 🎉 The event starts at 10 AM this Saturday. We’re planning some lovely samples and a little workshop too! Bring your appetite! 😋❤️\nLiHua: Cool, I’ll be there at 10 AM! Looking forward to tasting all the healthy goodies and the workshop sounds fun! See you Saturday! 🌟\nHaileyJohnson: Yay! Can't wait to see you! If you have any friends who might be interested, feel free to bring them along. The more, the merrier! 🎉🥳\nLiHua: I might bring Wolfgang along, he loves bread too! Should be a good time! See you then! 🍞😄\nHaileyJohnson: That sounds perfect! The more bread lovers, the better! See you both on Saturday! 🥳💖",
    "content_summary": "Time: 20260622_13:30\nHaileyJohnson: Hey Li Hua! 😊 Just wanted to invite you to a special event at th...",
    "content_length": 1056,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week25\\20260622_1330.txt",
    "metadata": {
      "id": "doc_54",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week25\\20260622_1330.txt"
    },
    "created_at": "2025-09-01T17:03:48.745065",
    "updated_at": "2025-09-01T17:03:48.777701"
  },
  "doc-5b9ef211a9ed93a176a3587a5e8caf66": {
    "status": "processed",
    "chunks_count": 8,
    "content": "Time: 20261014_20:00\nJakeWatson: Hey guys! I just saw a few classic comebacks from Real Madrid! I gotta say Real Madrid is just something else! They really know how to turn things around, don't they? It's like they thrive under pressure. I remember watching a game where they were down by two goals, and somehow, they found their way back! It's that never-say-die attitude. What do you all think?\nEvangeline: Totally agree! Their mindset makes such a big difference when games get tough. Plus, having players like Benzema and now Bellingham stepping up in big moments definitely helps. Their ability to stay calm and make the right decisions under pressure is insane. What match stood out to you the most where they pulled off a comeback?\nJakeWatson: One that really stuck with me was the famous Champions League comeback against Manchester City in 2022! That stoppage-time goal by Rodrygo was just epic! They looked done for, but somehow managed to score two in quick succession. It just shows their belief and determination. What a night!\nBriar: Right?! That match was pure drama! It's like once they got that first goal, you could feel the momentum shift. They just refuse to give up. And their fans were absolutely wild in the stands! Makes you wonder how many other clubs can pull off such thrilling comebacks like that.\nAurora: For sure! The atmosphere at the Bernabéu during that game was electric! Real Madrid really has a strong home advantage, and their fans play a huge role in lifting the team during those tough moments. Just shows how important the spirit of the team and its supporters are in those nail-biting situations. \nEvangeline: It’s crazy how deeply connected the fans and players are! When the players feel that energy from the crowd, it definitely pushes them to dig deeper. Plus, let’s not forget their legendary history in the Champions League. That winning culture is ingrained in everyone at the club. It’s almost like they expect to come back and win even when things look bleak!\nLiHua: Exactly! That winning mentality is built into the club's DNA. You can see it in their players too; they all know how to rise to the occasion. It’s inspiring watching them pull through when the odds are against them. Makes every game an adventure, right?\nJakeWatson: For sure! Every match feels like a rollercoaster ride with them. It’s that unpredictability that makes soccer so exciting! Just when you think it's over, bam! Madrid shows up and surprises everyone. That’s what keeps me hooked! What about you all, do you think they can keep this momentum going for the rest of the season?\nBriar: I think they absolutely can! With their depth in the squad and the new talent mixed in, they have a solid chance to challenge for every title. Plus, Ancelotti knows how to get the best out of his players, even in crunch moments. It’ll be interesting to see if they can maintain that level of energy and drive throughout the season!\nIvor: Definitely! If they can keep this spirit and not let injuries affect them, I believe they could go all the way in LaLiga and Champions League. They've got the experience and youth combo, which seems to be working well. Any predictions on their next match?\nLiHua: I think they should manage to win if they keep up the energy! Their attacking force is looking sharp, and if they capitalize on the chances, they should be fine. Plus, playing at home always gives them an edge!\nIvor: Yeah, home advantage is definitely on their side! If they stay disciplined at the back and control the midfield, they should have a good shot. Can’t wait to see how it plays out!\nDacey: Hey everyone! Just wanted to see if anyone's free this weekend to practice some soccer? I’m looking to work on my shooting skills, maybe Saturday afternoon? Let me know!\nJasper: I’m in! Saturday afternoon works great for me. I could also use some practice on my shooting. Where do you want to meet?\nIvor: I'm down too! Just let us know the place, and we can get some practice in together. It's always nice to kick the ball around!\nAurora: Sounds awesome! How about we meet at the local park around 3 PM on Saturday? Let's bring some cones and have fun while working on our shots!\nIvor: 3 PM at the local park sounds perfect! I’ll bring a ball and some cones too. This should be a great way to improve our shooting skills while having a blast! Looking forward to it!\nHenley: Can't wait! It's gonna be fun. Also, I’m planning to work on my dribbling skills a bit while we’re at it. See you all on Saturday!\nCaspian: Awesome! Dribbling practice will definitely be a good addition to our shooting drills. It’s gonna be a great session!\nGiselle: If anyone needs a hand with setting up drills or anything else, just let me know! I'm excited to mix it up and improve together! See you on Saturday!\nEvangeline: I’m looking forward to it! It’s going to be a blast practicing together and polishing our skills. It helps a lot to train with others!\nBriar: Can't wait for Saturday! It'll be a great day to practice and enjoy some soccer together. Let's all bring our A-game!\nFarrah: So ready for Saturday! Let’s make it a fun and productive day on the field. See everyone there!⚽\nJasper: Haha, this is going to be so much fun! I love that we can all come together and enjoy soccer while improving our skills. Can't wait!\nJasper: See you all on Saturday! It’s going to be a great time! \nAurora: Excited for Saturday! Let's make the most of it and have a fun practice! See you all!\nJakeWatson: This Saturday is gonna be epic! Let's all get pumped and bring our best energy! See you on the field! ⚽️💪\nFarrah: Can't wait! Let’s make it awesome!\nJakeWatson: So ready! Bring on the fun and practice! \nCaspian: Looking forward to it! Let's make sure to enjoy it while we improve our skills!\nLiHua: Absolutely! It’s all about having a great time and leveling up our game! See you all then! 🎉\nBriar: Gonna be a blast! Let’s show off those skills! See you guys Saturday! 🎉⚽️\nHenley: Looking forward to it! It's going to be awesome stretching our skills together! See everyone there!\nFarrah: So excited for Saturday! Let's bring our best vibes and have a fantastic time practicing together! See you soon! 🌟\nEvangeline: It's gonna be a great day! Can't wait to see you all and have fun while practicing! Let's do this!\nHenley: Let’s keep the spirits high! The more we work together, the better we'll all get. Saturday is gonna be lit! 🙌⚽️",
    "content_summary": "Time: 20261014_20:00\nJakeWatson: Hey guys! I just saw a few classic comebacks from Real Madrid! I go...",
    "content_length": 6431,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week41\\20261014_2000.txt",
    "metadata": {
      "id": "doc_55",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week41\\20261014_2000.txt"
    },
    "created_at": "2025-09-01T17:03:55.704865",
    "updated_at": "2025-09-01T17:03:55.839358"
  },
  "doc-101357bb0ad196a4b1872fb5b1383fe5": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260429_08:01\nAlice: I am Alice from Hailey's bakery. Your bread has been delivered, please come and pick it up ASAP. Have a good day : )",
    "content_summary": "Time: 20260429_08:01\nAlice: I am Alice from Hailey's bakery. Your bread has been delivered, please c...",
    "content_length": 144,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\bakery_deliver\\20260429.txt",
    "metadata": {
      "id": "doc_56",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\bakery_deliver\\20260429.txt"
    },
    "created_at": "2025-09-01T17:04:02.910769",
    "updated_at": "2025-09-01T17:04:02.925889"
  },
  "doc-9a394cde824a72e20037ed828194257b": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260331_17:00\nLiHua: Hey Adam, just wanted to let you know that I've already transferred this month's rent through the bank. Thanks!\nAdamSmith: Great, thanks for the update! Glad to hear everything's sorted. Let me know if you need anything.\nLiHua: Will do! Hope you're having a good day!\nAdamSmith: Thanks! Just wrapping up work. How's everything going with the apartment?\nLiHua: All good here! Just loving the space and settling in nicely. How about you?\nAdamSmith: I'm doing well, thanks! Family's good too. If you ever need anything for the apartment, just let me know!\nLiHua: I appreciate that! I'll keep it in mind. Hope to catch you around!",
    "content_summary": "Time: 20260331_17:00\nLiHua: Hey Adam, just wanted to let you know that I've already transferred this...",
    "content_length": 654,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week13\\20260331_1700.txt",
    "metadata": {
      "id": "doc_57",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week13\\20260331_1700.txt"
    },
    "created_at": "2025-09-01T17:04:09.720822",
    "updated_at": "2025-09-01T17:04:09.745009"
  },
  "doc-388904c2944d1a768a71049fbcd631e1": {
    "status": "processed",
    "chunks_count": 7,
    "content": "Time: 20261024_11:00\nTuralyon: Hey everyone! 🌼 Just wanted to let you know we’re organizing a weekend picnic to bring the community together. It’ll be a fun way to relax and get to know each other better! 🍉🌳 Would love to see you all there! 🎉\nChaeSong-hwa: Sounds like a great idea! What time are we thinking of starting? 😄\nTirionFordring: A picnic sounds awesome! Just imagine everyone enjoying the newly renovated garden together. It could really boost our community spirit! 🌞🪴\nLiHua: I think it’s a fantastic idea! Count me in for the picnic! It’ll be fun to chill out and meet everyone. 😊\nTuralyon: Let’s plan to have some games and maybe a potluck? Everyone can bring a dish to share! 🍽️🎈 It'll make it even more special! What do you guys think?\nIllidanStormrage: I'm totally on board with the potluck idea! It'll be a nice way to try everyone's cooking. Just make sure to bring your best dish! 🍽️😋\nTuralyon: Yeah, and if anyone has ideas for games or activities, feel free to share! It’ll be great to have some fun things to do while we relax. 🎲🌼\nMalfurionStormrage: Can’t wait for this picnic! Just a little break after all that hard work in the garden renovation. 🌳✨ Looking forward to seeing what everyone brings!\nIllidanStormrage: Definitely! It's nice to take a breather and enjoy the fruit of our labor. Plus, the flowers will be blooming by then, so it'll be extra beautiful! 🌸😊\nRexxarRemar: Hey folks, what do you all think about organizing some music for the picnic? A little background music could really set the mood! 🎶🌞\nTirionFordring: Music sounds like a great touch! It will really enhance the atmosphere and create a joyful vibe. 🎵 Just make sure it's not too loud, so we don’t disturb anyone nearby.\nTirionFordring: Also, please consider bringing some blankets or chairs for seating, since it might get a bit crowded! 🧺🪑\nRexxarRemar: Good thinking! Blankets would be perfect for relaxing on the grass and enjoying our food. Plus, it'll add to the cozy vibe! 🥰🌳\nMalfurionStormrage: I can't wait to see everyone there! It'll be such a great chance to enjoy the garden renovations together. 🌺🌿 Let's make some wonderful memories!\nGromHellscream: Looking forward to it! It's going to be a blast! Let's make sure we all bring our best energy! 💪🏽🎉\nRexxarRemar: I agree, let’s bring our A-game and make it an unforgettable picnic! Who's getting the snacks? 🍕🌭\nMuradinBronzebeard: I think we should have a mix of snacks and drinks to keep everyone energized. Maybe someone could handle desserts too? 🍰🥤 What do you guys think?\nRexxarRemar: Desserts would definitely be a hit! 🍪 Maybe we can have a little competition for who can bring the best treat? That could be fun! 🎉🍩\nRexxarRemar: Oh, and let’s make sure to have some water and drinks available to keep everyone hydrated! It might get warm out there. 💧🌞\nTirionFordring: Good point! Staying hydrated is key, especially if we're outside for a while. Maybe we can set up a small drink station with water and some refreshments? 🥤☀️\nAdamSmith: Sounds like a solid plan for the picnic! Really looking forward to enjoying the day with everyone! 😊🌈\nAdamSmith: Are we thinking of setting a date for the picnic? I can help with the planning if needed! 🍉\nMuradinBronzebeard: Let's say next Saturday for the picnic? That'll give everyone time to prepare and bring their dishes. How does that sound? 🗓️🎉\nIllidanStormrage: Next Saturday works for me! It'll be the perfect opportunity to enjoy the new garden. Can't wait! 🌿🥳\nGromHellscream: Count me in! Excited for a fun day with everyone and all the yummy food! 🍽️😃\nThrall: Next Saturday is set then! Let’s make it an enjoyable day – I’m stoked! 🌼🎊\nIllidanStormrage: It's gonna be epic! Just make sure to spread the word to everyone in the community so we can have a big turnout! 🌟\nIllidanStormrage: I’ll reach out to others and make sure they know. The more, the merrier! 💬🎉\nArthasMenethil: Sounds like the picnic is shaping up to be a fantastic event! Can’t wait to see what everyone brings! 🌞🥳\nMalfurionStormrage: Let’s make it a memorable day for everyone! I’m looking forward to it! 🌳✨\nIllidanStormrage: I'll be making sure to bring my signature dish to impress! 😉🍽️ Let's get this picnic going!\nAdamSmith: I'll handle some drinks for the picnic, so everyone can stay refreshed! 🥤\nAdamSmith: Just let me know if there’s anything else I can do to help with the picnic planning! Looking forward to a great day! 🎈\nRexxarRemar: Hey everyone, don’t forget to double-check your contributions for the picnic! It’s going to be a great time! 🎉🌞\nMuradinBronzebeard: So pumped for this picnic next Saturday! Let’s make it a blast with good food, games, and music! 🍉🎶 Can't wait to see all of you! 🌼\nIllidanStormrage: I’ll make sure to bring some epic games to keep everyone entertained! Let’s make this picnic legendary! 🎲🔥",
    "content_summary": "Time: 20261024_11:00\nTuralyon: Hey everyone! 🌼 Just wanted to let you know we’re organizing a weeken...",
    "content_length": 4823,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week42\\20261024_1100.txt",
    "metadata": {
      "id": "doc_58",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week42\\20261024_1100.txt"
    },
    "created_at": "2025-09-01T17:04:17.434701",
    "updated_at": "2025-09-01T17:04:17.539515"
  },
  "doc-4ed2d5c7b240ff16d55baabb29eb1d3e": {
    "status": "processed",
    "chunks_count": 9,
    "content": "Time: 20260630_15:30\nJenniferMoore: Hey everyone! 🌊 Just a little tip for everyone: Staying hydrated during workout is very important! Let's keep track of our water intake today and motivate each other. How much are you aiming to drink? 💧💪\nBreach: I'm aiming for at least 3 liters today! Feels good to stay hydrated during workouts, gives me more energy! How’s everyone else doing?\nRaze: I'm going for 2.5 liters today! Lately, I've noticed that staying hydrated really helps with my stamina, especially during those intense sessions. How do you guys feel during workouts when you're properly hydrated?\nCypher: I definitely feel more focused and have way better endurance! It's amazing how much hydration can affect performance. I usually try to drink a glass of water before starting my workout. How do you all keep track of your intake?\nSova: I usually just use a water bottle with measurements on it. It helps me stay aware of how much I’ve had throughout the day. Plus, I like to set little reminders on my phone! What about you guys?\nBreach: I like to fill up a big jug in the morning and just keep it with me all day. It really helps me see how much I've had and motivates me to finish it! Anyone else have tips or methods that work for them?\nBreach: I just set a timer every hour to remind me to drink water. It helps me stay consistent throughout the day. I find that if I don't have a reminder, I forget! What do you guys usually do when you lose track?\nViper: I keep a water bottle next to me while I work or relax. It’s a visual cue that reminds me to sip throughout the day. It’s surprising how just having it there makes a difference! Anyone else find similar tricks?\nRaze: I usually drink a glass of water before each meal; it not only helps me stay hydrated but also curbs my appetite a bit. Do you guys notice a difference in your workouts when you have that extra water before starting?\nCypher: For sure! I feel like having water before a workout really gets me energized. I tend to push myself harder and feel less fatigued. It's like a little boost to get me going. What about during workouts? Do you sip water then too?\nBreach: I do take sips during my workouts! Staying hydrated helps me maintain my focus, and I definitely feel better when I’m not too thirsty. Anyone else have their favorite time to drink water while working out?\nJenniferMoore: I like to take small sips during my breaks in between sets. It helps me recover faster and keeps my energy levels up. Plus, staying hydrated is key to keeping those gains coming! What about you guys?\nRaze: I usually take a few sips between exercises, especially during high-intensity workouts. It really helps me maintain my energy and keeps me feeling refreshed. Got any other hydration tips to share?\nViper: I also try to make it a habit to drink a good amount of water right after my workout. It feels great to replenish what I lost during exercise, and I'm always aiming for that post-workout glow! Anyone else have a similar routine?\nRaze: I like to drink some coconut water after working out! It’s really refreshing and helps with electrolytes. Do you guys have any favorite drinks for recovery?\nLiHua: I usually stick with plain water after workouts, but I've heard great things about electrolyte drinks! Have you guys ever tried adding some lemon or mint to your water for a little flavor boost? That really makes a difference!\nOmen: I’ve tried adding lemon! It’s super refreshing and gives a nice zing. I sometimes mix in cucumber too for an extra cool flavor. Have you all experimented with any other fruit-infused options?\nBrimstone: I’ve mixed berries in my water before and it adds a nice sweetness! Plus, it looks pretty cool. It’s like a little treat during hydration! Anyone else into fruit-infused water?\nCypher: I’ve tried adding orange slices, and it’s so refreshing! The citrus flavor is perfect for hot days. I love experimenting with different combinations. Any favorite mixes you all swear by?\nViper: I usually go for a combo of lemon and ginger! It’s super refreshing and gives me a nice little kick. Plus, ginger is great for digestion! Has anyone tried that?\nBreach: I haven't tried ginger yet, but it sounds great! I usually stick with mint and lime for a refreshing twist. Anyone else love mint in their water?\nBreach: Mint is awesome in water! It feels so fresh, especially after a workout. I also like to make herbal teas with mint for hydration. What about you guys, any other interesting ways you like to hydrate?\nSova: I’ve experimented with herbal teas too! They’re a great way to stay hydrated and come in so many flavors. I love chamomile for a relaxing evening or hibiscus for something fruity. Anyone else spice up their hydration game with teas?\nJenniferMoore: I love herbal teas too! Hibiscus is perfect for a refreshing drink, especially chilled. I’ve also enjoyed green tea for a little boost. Do you guys have any go-to herbal blends you’d recommend?\nRaze: I’ve been into mint and lemon balm lately! It’s super calming and refreshing at the same time. Plus, it's a nice change from regular water. What kinds of herbal teas do you all normally reach for?\nPhoenix: I usually stick with green tea for its antioxidants and energy boost. It’s such a simple way to hydrate and feel good! Anyone else prefer something specific for their post-workout recovery?\nOmen: I like to mix green tea with a bit of honey! It’s a nice touch after workouts and gives me a little sweetness without being too much. How do you all feel about adding sweeteners to your drinks?\nOmen: I tend to avoid sweeteners, preferring just to keep it natural. I think it helps to appreciate the true flavors, especially when it comes to fruits in my water. Anyone else feel the same way?\nPhoenix: I’m with you on that! Natural flavors are the best. I find that fresh herbs or fruits give enough taste without needing extra sweetness. It just feels healthier! What’s everyone’s favorite herb or fruit combo for water?\nCypher: I love a good mix of basil and strawberries! It’s so unique and refreshing. It makes the water feel fancy, you know? What's your go-to combo?\nViper: I’m all about cucumber and mint! It’s super refreshing and great for hydration. Keeps me feeling cool, especially in this heat! Anyone tried that combo too?\nOmen: I haven't tried that combo yet, but it sounds delicious! I usually go for watermelon and mint. It's so hydrating and light. Great for summer workouts! Have you all experimented with different fruits lately?\nBreach: I haven't tried watermelon and mint, but it sounds perfect! I recently had pineapple and sage, which was really refreshing too. What unique combos have you guys come up with?\nSova: I once tried kiwi and basil, and it was surprisingly good! The tartness of kiwi pairs nicely with the earthiness of basil. Has anyone come across any unexpected combos that turned out great?\nSage: I’ve mixed peach and rosemary before, and it was so refreshing! The sweetness of the peach with that savory hint from the rosemary was a game-changer. Anyone else have fun flavor discoveries?\nBreach: I love the sound of that combo! I recently tried apple and cinnamon, and it felt like a cozy drink. Have you guys experimented with any seasonal flavors lately?",
    "content_summary": "Time: 20260630_15:30\nJenniferMoore: Hey everyone! 🌊 Just a little tip for everyone: Staying hydrated...",
    "content_length": 7265,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week26\\20260630_1530.txt",
    "metadata": {
      "id": "doc_59",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week26\\20260630_1530.txt"
    },
    "created_at": "2025-09-01T17:04:25.037207",
    "updated_at": "2025-09-01T17:04:25.186711"
  },
  "doc-1db7c353babbbb0d58871e2691548ab8": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20261009_17:00\nLiHua: Hey man! Just wondering if you want to watch the classic movie Star Wars: A New Hope at my place after work today?\nWolfgangSchulz: Hey! 😄 Sounds great! Want to grab some snacks too for the movie? 🍿✨\nLiHua: For sure! I can bring some chips! What drinks do you want? 🥤\nWolfgangSchulz: Awesome! Just some soda and juice will be perfect. Can't wait for the movie night! 🚀🎥\nLiHua: Cool! I'll pick them up on my way. See you soon! 🎉\nWolfgangSchulz: See you! 😄 Don't forget the snacks!",
    "content_summary": "Time: 20261009_17:00\nLiHua: Hey man! Just wondering if you want to watch the classic movie Star Wars...",
    "content_length": 506,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week40\\20261009_1700.txt",
    "metadata": {
      "id": "doc_60",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week40\\20261009_1700.txt"
    },
    "created_at": "2025-09-01T17:04:32.704745",
    "updated_at": "2025-09-01T17:04:32.725829"
  },
  "doc-1971e123eca16398b674afb3ace72034": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260531_20:00\nLiHua: Hey Hailey! I saw the new banana durian cheesecake you showcased today. Can I get a try when you deliver on Monday? Sounds delicious! 😋\nHaileyJohnson: Absolutely! I'll make sure Alice includes a slice for you on the delivery. I can't wait for you to try it! 🥳\nLiHua: You're the best! Thanks a ton! Hope you have a great weekend! 🍰✨\nHaileyJohnson: You too! Enjoy the weekend! Can’t wait for you to taste that cheesecake! 🍌🍰",
    "content_summary": "Time: 20260531_20:00\nLiHua: Hey Hailey! I saw the new banana durian cheesecake you showcased today. ...",
    "content_length": 450,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week21\\20260531_2000.txt",
    "metadata": {
      "id": "doc_61",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week21\\20260531_2000.txt"
    },
    "created_at": "2025-09-01T17:04:40.744201",
    "updated_at": "2025-09-01T17:04:40.764817"
  },
  "doc-5c29c8b3945bfacb6fcd6dccb1769252": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260919_10:00\nJenniferMoore: Hey Li Hua! Just a quick reminder to make sure you're getting enough protein after our workouts. It's super important for keeping that body in shape! 💪🏽🥗\nLiHua: Thanks for the reminder! I’ll definitely focus on that, especially after our sessions. 🚀\nJenniferMoore: Awesome! You’re doing great! Keep it up, and let me know if you need any tips on protein sources. 😊\nLiHua: Will do! I appreciate the support. By the way, any fun plans for the weekend? 🌟\nJenniferMoore: Just catching up on some reading and maybe a hike! How about you? Any activities lined up? 😊\nLiHua: I’ll probably just chill at home, maybe play some games or jam with the band tomorrow night. 🎸✨\nJenniferMoore: Sounds like a fun time! Enjoy your weekend and recharge for our next session! 💪🏽🌟\nLiHua: Thanks! You too! Talk soon!",
    "content_summary": "Time: 20260919_10:00\nJenniferMoore: Hey Li Hua! Just a quick reminder to make sure you're getting en...",
    "content_length": 830,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week37\\20260919_1000.txt",
    "metadata": {
      "id": "doc_62",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week37\\20260919_1000.txt"
    },
    "created_at": "2025-09-01T17:04:48.811713",
    "updated_at": "2025-09-01T17:04:48.837753"
  },
  "doc-3ff26d4b91b3312e80864b70794b6d98": {
    "status": "processed",
    "chunks_count": 6,
    "content": "Time: 20261221_21:00\nTuralyon: Hey everyone! Just wanted to let you know we're organizing some fun Christmas events this weekend! 🎄✨ There'll be activities for all ages, so make sure to bring your family and friends! More details coming soon! 🥳\nRexxarRemar: Sounds awesome! Can't wait to see what you have planned! 🎉\nArthasMenethil: What kind of activities are you thinking of for the events? Hope it includes some fun games! 🎈\nThrall: I’m sure there will be plenty of games and fun stuff for everyone! It’s a great way to celebrate the holidays together. 🎊\nGromHellscream: Sounds like there's excitement in the air! I’m looking forward to seeing everyone at the events! Let’s make it a memorable time! 💪\nTuralyon: Looking forward to your input on the activities, guys! Let's create something special for our community! 🎉\nRexxarRemar: I'm curious about how we can incorporate the new garden features into the events! Maybe some of the activities could take place in the garden area? 🌷\nArthasMenethil: Definitely! The new benches and planted flowers will make the garden a perfect spot for some festive gatherings. We could set up some holiday-themed crafts for kids there too! 🎨🌼\nGromHellscream: I like that idea! Let’s use the garden as a key part of the festivities. It’ll be great for everyone to enjoy the fresh air together! 🪴\nRexxarRemar: Absolutely, it's the perfect way to show off the renovations and bring the community together! 🌟\nLiHua: I’m really excited about the events! It’ll be a great way to connect with everyone during the holidays. Let's make some memorable moments together! 🎉🎄\nAdamSmith: I can definitely help with the setup if needed! Just let me know how I can pitch in. 💪\nArthasMenethil: Looking forward to everyone’s contributions! It’s going to be a great celebration! 🎊\nMuradinBronzebeard: Yeah, let's all work together to make the events unforgettable! Excited to see everyone contributing! 💥\nThrall: I'm really looking forward to the holiday cheer! It's great to see everyone enthusiastic about the events! 🎅✨\nGromHellscream: Let's keep sharing ideas and make this celebration epic for everyone! Can't wait for the weekend! 🎉\nTirionFordring: This is shaping up to be a fantastic weekend! It's great to see so much enthusiasm for the events! Let's keep the ideas flowing! 🌟\nTuralyon: I can feel the excitement building! We got a great team here, and I can’t wait to see everyone come together for a fantastic Christmas celebration! 🎄❤️\nLiHua: I’m all in for making this celebration memorable! Let’s keep the excitement high and have a blast together! 🎉💫\nTirionFordring: Absolutely! It's all about bringing the community together and spreading that holiday spirit! Let's make it unforgettable! 🌟\nRexxarRemar: I’m excited about how we can all come together for this! Let's keep sharing ideas to make this celebration even better! 🎊\nMalfurionStormrage: I'm looking forward to all the fun and joy we can create together in our community! Let's make this Christmas season special for everyone! 🎉\nAdamSmith: This is such a great initiative! I’m excited to see all the planning come together and create wonderful memories! 🎄\nTirionFordring: Looking forward to seeing everyone's ideas flourish during the celebrations! It'll definitely create a warm atmosphere for our community! 🌼🎉\nMalfurionStormrage: It’s so nice to see all the enthusiasm! I believe this weekend will be a celebration to remember! 🎈\nTuralyon: Let’s keep the ideas coming and make this a Christmas to remember! Thanks for all your enthusiasm, everyone! 🎅✨\nAdamSmith: Can’t wait for it all to come together! It’ll be great to celebrate with everyone! 🥳\nThrall: I’m sure we’re gonna have an amazing Christmas event! Let’s keep the good vibes going! 🎉\nAdamSmith: Absolutely! The more we collaborate, the more fun we’ll have! Looking forward to it! 🌟\nAdamSmith: It sounds like it's going to be a fantastic time for everyone involved! Keep the ideas flowing, guys! 🎄\nRexxarRemar: Let's all make sure to collaborate so we can create an unforgettable experience! The holiday spirit is strong in this group! 🎊\nRexxarRemar: What a great time is ahead! The enthusiasm and ideas just keep growing, let’s channel that energy into planning! Can't wait! 🎉\nAdamSmith: I’m all in for making this a memorable celebration! The holiday spirit is infectious! Let’s do this! 🎄✨\nAdamSmith: So, when are we meeting to finalize everything? It’ll be good to nail down the details soon! 📅\nMuradinBronzebeard: Let’s keep discussing here to finalize everything. It’s easier to coordinate through the chat! 📲\nThrall: Definitely! It makes planning so much smoother. I’m excited about the next steps! 🎉",
    "content_summary": "Time: 20261221_21:00\nTuralyon: Hey everyone! Just wanted to let you know we're organizing some fun C...",
    "content_length": 4662,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week51\\20261221_2100.txt",
    "metadata": {
      "id": "doc_63",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week51\\20261221_2100.txt"
    },
    "created_at": "2025-09-01T17:04:56.992800",
    "updated_at": "2025-09-01T17:04:57.081594"
  },
  "doc-db00a87082e8ef1090d304ca2620f150": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260918_18:00\nWolfgangSchulz: Hey! Wanna hit Starbucks after work and try that new Frappuccino? ☕️🍹\nLiHua: Sounds awesome! I could use a sweet treat after a long week. What time are you thinking?\nWolfgangSchulz: How about around 6:30? We can chill and catch up before the weekend. 🎉\nLiHua: 6:30 works for me! Looking forward to relaxing at Starbucks. See you then!\nWolfgangSchulz: Great! Can't wait! See you in a bit! 🙌",
    "content_summary": "Time: 20260918_18:00\nWolfgangSchulz: Hey! Wanna hit Starbucks after work and try that new Frappuccin...",
    "content_length": 426,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week37\\20260918_1800.txt",
    "metadata": {
      "id": "doc_64",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week37\\20260918_1800.txt"
    },
    "created_at": "2025-09-01T17:05:05.484610",
    "updated_at": "2025-09-01T17:05:05.506768"
  },
  "doc-d78eb143762192ac233214003d682cc4": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260608_14:30\nLiHua: Hey Yuriko! Are you planning to attend the Freelancer Group Meeting this Wednesday at 3 pm? \nYurikoYamamoto: Yeah, I’ll be there! Looking forward to it. Should be fun! 😊\nLiHua: Awesome! I can’t wait! It’s always great to catch up with everyone. Do you have any topics in mind to discuss?\nYurikoYamamoto: I was thinking about sharing some new therapy techniques I've been exploring. Maybe others would find it helpful too! What about you? Any ideas?\nLiHua: That sounds great! I might share some tips on managing work-life balance as a freelancer. It's been a journey!\nYurikoYamamoto: Sounds like a valuable topic! I'm sure many will appreciate that. It's important to find that balance! 😊\nLiHua: Totally! It's all about staying sane while juggling things. By the way, are you still enjoying those jam sessions on Sundays?\nYurikoYamamoto: Yes! It’s such a blast playing together! Love the vibes we've created. Can't wait for the next one! 🎶\nLiHua: Same here! It's the highlight of my week. Do you have any favorite songs you’d want to try next time?\nYurikoYamamoto: Maybe we could try something new, like a classic rock song or a fun pop tune! What do you think?\nLiHua: That sounds perfect! I'm always up for classic rock! Let's brainstorm a couple of options before Sunday. 🎸\nYurikoYamamoto: Absolutely! I’ll think of some good ones and share them in the group. Looking forward to it! \nLiHua: Cool! See you at the meeting and Sunday jam!",
    "content_summary": "Time: 20260608_14:30\nLiHua: Hey Yuriko! Are you planning to attend the Freelancer Group Meeting this...",
    "content_length": 1464,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week23\\20260608_1430.txt",
    "metadata": {
      "id": "doc_65",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week23\\20260608_1430.txt"
    },
    "created_at": "2025-09-01T17:05:13.982654",
    "updated_at": "2025-09-01T17:05:14.017792"
  },
  "doc-5e77073bef165eaf7cc99f1d7235e5bb": {
    "status": "processed",
    "chunks_count": 5,
    "content": "Time: 20260425_23:30\nLiHua: Hey everyone! 😊 I'm really glad we could all connect here. Chae, Wolfgang and Yuriko are amazing! I hope we can all enjoy some good conversations and maybe plan some fun get-togethers. What do you all think?\nLiHua: So, Chae, do you play any instruments or have any hobbies? It'd be cool to know more about what you enjoy! 🎶\nChaeSong-hwa: I love singing and used to be in a musical club back in college! 🎤✨ I still enjoy warm songs. How about you guys? Any musical interests?\nLiHua: That's awesome, Chae! We're all into music here. 🎸🎶 I play guitar and have jam sessions with Wolfgang and Yuriko every Sunday! Yuriko loves playing bass, and Wolfgang used to drum in a band. What kind of music do you like to sing?\nYurikoYamamoto: Oh, that's so cool! 🎶 I love a mix of genres, but I really enjoy classic rock and acoustic songs. They have such great melodies! Do you have a favorite song to perform?\nYurikoYamamoto: I think classic rock would suit your voice perfectly! 🎤 If you ever want to collaborate on a song or sing together during our jam sessions, I'm totally in!\nChaeSong-hwa: I appreciate the offer! Collaboration sounds fun! I'm open to a variety of genres, so let’s see what we can come up with together. 🎶 Would be great to jam on some classic rock songs!\nWolfgangSchulz: Nice! Classic rock is always a hit. 🎸 Just let me know if you want to try something specific during one of our sessions!\nWolfgangSchulz: Looking forward to it! Let’s make our Sundays even more fun with some new tunes! 🎶\nLiHua: Yeah! I can't wait to hear what we come up with together. It'll be a blast! Let's keep the good vibes going! 😊\nLiHua: Do you guys have any favorite classic rock songs in mind for our next jam? 🤘🌟\nChaeSong-hwa: I really enjoy \"Hotel California!\" It's such a classic. What about you guys? Any other favorites we should consider?\nChaeSong-hwa: \"The Joker\" by Steve Miller Band is one of my all-time favorites! It's super catchy and fun to sing along to. 🎶 What do you think?\nLiHua: That's a great choice! I love \"Hotel California\" too! 🎸 Maybe we could mix it up and create a little medley? What do you all think?\nYurikoYamamoto: That sounds exciting! A medley would be awesome! We could blend different vibes and make it really special! 🎶 Any other songs you'd like to add?\nChaeSong-hwa: Let’s definitely keep brainstorming for our medley! I think a bit of \"Sweet Home Alabama\" could fit nicely in there. What do you guys think? \nLiHua: Perfect! \"Sweet Home Alabama\" would add such a fun vibe to our medley! 🎶 I'm getting excited about our next jam session already! \nLiHua: What about \"Blackbird\"? It's acoustic and would fit well! 🕊️✨\nWolfgangSchulz: \"Blackbird\" is a beautiful choice! It would bring a nice contrast to our medley. 🎤 I love it!\nChaeSong-hwa: I'm really loving all these song ideas! We'll have such a great time putting this medley together. Can't wait for Sunday! 🎶✨\nYurikoYamamoto: It's going to be an awesome jam! I'm really looking forward to it! Let's bring all the energy! 🎸😊\nLiHua: Definitely! It's going to be a memorable session, everyone! Let's rock it! 🤘🎶\nWolfgangSchulz: Can't wait! See you all Sunday! 🎉\nLiHua: See you all then! 🌟 Let’s make it a night to remember! 🥳\nLiHua: Alright, I'm off for now! Good night, everyone! 🌙✨\nChaeSong-hwa: Good night, everyone! Catch you later! 😊🌙\nYurikoYamamoto: Sweet dreams, everyone! Looking forward to Sunday! 🌟😊\nLiHua: Sleep well, everyone! Can't wait to jam! 🎶🌙",
    "content_summary": "Time: 20260425_23:30\nLiHua: Hey everyone! 😊 I'm really glad we could all connect here. Chae, Wolfgan...",
    "content_length": 3468,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week16\\20260425_2330.txt",
    "metadata": {
      "id": "doc_66",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week16\\20260425_2330.txt"
    },
    "created_at": "2025-09-01T17:05:22.522460",
    "updated_at": "2025-09-01T17:05:22.598151"
  },
  "doc-cdea42ea3ce10c836b520f7b691f729e": {
    "status": "processed",
    "chunks_count": 3,
    "content": "Time: 20260730_15:00\nChaeSong-hwa: Hey Li Hua! Remember last time I told you that I was under a lot of stress because of my research been stucking for a while?\nChaeSong-hwa: I'm happy to share with you that my team and I have finally made some progess!\nLiHua: Oh wow! Awesome to hear about your progress! I'm so proud of you!\nChaeSong-hwa: Thanks! It feels great to see some progress finally. It’s been a tough ride. I’m hoping to keep the momentum going. How are you doing? Hope everything’s good on your end!\nLi Hua: I'm doing well, just juggling some freelance work. Also excited for our jam session this Sunday! Got any new ideas for songs?\nChaeSong-hwa: Glad you're doing well! Yeah, I'm looking forward to Sunday too. I was thinking we could try out a few classics, maybe some new stuff we haven't played yet. What do you think?\nLiHua: That sounds great! I'm always up for some classics. Any specific songs you have in mind? Let’s make it a fun session!\nChaeSong-hwa: How about we mix it up a bit? Maybe include some Fleetwood Mac? And we could also try something from the current charts! What do you think?\nLiHua: Love the idea! Fleetwood Mac always brings good vibes. I'm down for a mix of old and new. Let's rock it! 🎸\nChaeSong-hwa: Perfect! Can't wait to jam together. It's always a blast with you guys.  Should we set a time to meet up before the jam?\nLiHua: Yeah, good idea! Maybe we can meet an hour earlier to go over the songs? That would give us time to get comfortable with everything. What do you think?\nChaeSong-hwa: Sounds like a plan! Meeting an hour early works for me. Let’s make sure we’re all set to have a great time! \nLiHua: Absolutely! Looking forward to it! I’ll bring my new guitar too. See you then! 🎶\nChaeSong-hwa: See you! Can’t wait to hear it!",
    "content_summary": "Time: 20260730_15:00\nChaeSong-hwa: Hey Li Hua! Remember last time I told you that I was under a lot ...",
    "content_length": 1778,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week30\\20260730_1500.txt",
    "metadata": {
      "id": "doc_67",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week30\\20260730_1500.txt"
    },
    "created_at": "2025-09-01T17:05:31.369501",
    "updated_at": "2025-09-01T17:05:31.416690"
  },
  "doc-4a92e39833eb4640c835408756586de9": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260106_13:00\nLiHua: Hey Adam, just wanted to let you know that the water tab in the apartment is broken. Could you please help me out with that? Thanks!\nAdamSmith: Thanks for letting me know about the water tab. I'll arrange for someone to take a look at it as soon as possible. Please hang in there!\nLiHua: I appreciate it! Just let me know when they’ll be coming by. Thanks again!\nAdamSmith: I'll keep you updated once I have the repair schedule. If you have any other issues, feel free to reach out.\nLiHua: Sounds good! I’ll keep an eye on things. Thanks for being so responsive!\nAdamSmith: No problem at all! I'm here to help. Just let me know if you need anything else.",
    "content_summary": "Time: 20260106_13:00\nLiHua: Hey Adam, just wanted to let you know that the water tab in the apartmen...",
    "content_length": 682,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week1\\20260106_1300.txt",
    "metadata": {
      "id": "doc_68",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week1\\20260106_1300.txt"
    },
    "created_at": "2025-09-01T17:05:40.673240",
    "updated_at": "2025-09-01T17:05:40.697324"
  },
  "doc-03508fd684ee63da42c76eb7bc566c09": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20261119_10:00\nLiHua: Hey, Jake! I always feel like goalkeeper may be the least important person on the field. But I think maybe I'm wrong. What do you think?\nJakeWatson: A good goalkeeper is like the backbone of a soccer team! They save goals that could change the game and can really boost team morale. It’s not just about how they stop shots, but also how they organize the defense and inspire confidence in the players around them. You'd be surprised how much impact they have! 🥅⚽\nLiHua: Totally agree! It's like a solid defense starts from having a great keeper. They really can make all the difference, especially in tight matches! Do you play in goal sometimes? 🧤⚽\nJakeWatson: I've dabbled a bit in goal, but I prefer being a forward. Scoring goals is just so thrilling! 🥳 But I definitely appreciate what keepers do. Maybe I can show you some drills next time we practice!\nLiHua: That sounds awesome! I'd love to learn some techniques from you. Plus, it’ll be great to practice together! When do you want to hit the field? ⚽️🔥\nJakeWatson: How about this weekend? Saturday morning could be perfect! We can get some good practice in and maybe even kick a few goals! What do you think?\nLiHua: Sounds like a plan! I'm in! Saturday morning it is! Looking forward to it! ⚽😄",
    "content_summary": "Time: 20261119_10:00\nLiHua: Hey, Jake! I always feel like goalkeeper may be the least important pers...",
    "content_length": 1281,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week46\\20261119_1000.txt",
    "metadata": {
      "id": "doc_69",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week46\\20261119_1000.txt"
    },
    "created_at": "2025-09-01T17:05:49.982286",
    "updated_at": "2025-09-01T17:05:50.017886"
  },
  "doc-8a8e39df2737ba5252a5b1f5a7722046": {
    "status": "processed",
    "chunks_count": 5,
    "content": "Time: 20261224_14:00\nWolfgangSchulz: Merry Christmas everyone! 🎄 Hope you all have a fantastic day filled with joy and good tunes! Can't wait to jamming with you all soon! 🥁🎶\nYurikoYamamoto: Merry Christmas! 🎉 So grateful to have such amazing bandmates. Let's make some beautiful music together soon! Enjoy the festive vibes! 💖\nChaeSong-hwa: Merry Christmas, everyone! 🎊 Hope you all are surrounded by love and happiness today. Can't wait to celebrate with music soon! 🎤✨\nLiHua: Merry Christmas, everyone! 🎁 Wishing you all tons of joy today! Let's bring some awesome energy to our next jam session! 🥳🎸\nLiHua: Hope everyone is enjoying some delicious holiday treats today! 🍰 What's everyone's favorite Christmas dish? 🎄✨\nWolfgangSchulz: I just love a good gingerbread cookie! 🍪 What about you guys?\nYurikoYamamoto: I’m all about the sweet potato pie! It’s just the best during holidays. 😋 What do you like, Chae Song-hwa?\nYurikoYamamoto: I really enjoy a good roasted chestnut! So warm and cozy! 🌰❤️ How about you, Li Hua?\nLiHua: I'm definitely into honey glazed ham! It's such a tasty classic. 🍖🎉 Can't wait to gather and celebrate together!\nChaeSong-hwa: I’m a fan of classic turkey with all the sides! Can’t go wrong with that. 🦃🍽 What about our next session? Any songs in mind? 🎶\nWolfgangSchulz: I’d love to play something upbeat! Maybe we can work on some classic Beatles tracks? 🎵 \nWolfgangSchulz: How about we try a mix of some classic rock too? It could be a lot of fun! 🎸\nYurikoYamamoto: Let's mix in some holiday classics for the next jam! It could be a fun twist! 🎶✨ What do you all think?\nChaeSong-hwa: That sounds like a great idea! Holiday classics could bring a nice vibe to our session. 🎄🎤 Any particular songs in mind?\nYurikoYamamoto: I think \"Last Christmas\" would be a nice addition! Maybe we can do a fun version of it! What do you think? 🎶✨\nLiHua: \"Last Christmas\" is a great choice! 🎄✨ We can definitely put our spin on it! Any other favorites to add to the list? 🎵\nLiHua: How about \"Jingle Bells\" too? It's super fun to play! 🎶🛷 \nChaeSong-hwa: Let's definitely include \"Jingle Bells\"! It'll be a blast! 🎉 Any other ideas before we finalize our festive setlist? 🎸🎤\nLiHua: We should keep it simple and catchy! Let's stick with a few songs, and we can always add more next time. It's gonna be a fun session! 🎶🎄\nLiHua: How about a quick rehearsal before the holidays? Just to go through our set list! 🎶✨ \nYurikoYamamoto: That sounds like a good idea! A quick rehearsal will help us lock things in before the holidays. When are you thinking? 😊🎸\nYurikoYamamoto: I’m available after the holiday, maybe next week? Let’s just coordinate our schedules! 🎶✨\nChaeSong-hwa: Next week sounds good! Let’s see what day works for everyone. I’m flexible! 🎉🎤\nYurikoYamamoto: I can do pretty much any day next week too! Just let me know what works for everyone. 😊🎵\nLiHua: I'm good for any day next week as well! Just let’s pick a time and make it happen! 🎶🥳\nWolfgangSchulz: I'm really busy next week, so I'll have to pass on any rehearsals outside of our regular jam. Let's keep our Sunday night sessions! 🎵\nYurikoYamamoto: Sounds like a plan! We can finalize the details during our next jam then! Looking forward to it! 🎸✨\nLiHua: Absolutely! It’ll be fun to kick off the holidays with music on our next jam night! Can’t wait! 🎄🎶",
    "content_summary": "Time: 20261224_14:00\nWolfgangSchulz: Merry Christmas everyone! 🎄 Hope you all have a fantastic day f...",
    "content_length": 3331,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week51\\20261224_1400.txt",
    "metadata": {
      "id": "doc_70",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week51\\20261224_1400.txt"
    },
    "created_at": "2025-09-01T17:05:59.496623",
    "updated_at": "2025-09-01T17:05:59.581079"
  },
  "doc-a1104f7460d740dadd666b59887aafcc": {
    "status": "processed",
    "chunks_count": 2,
    "content": "Time: 20260223_15:00\nYurikoYamamoto: Hey Li Hua! 😊 It was great meeting you at the freelancer gathering today! I was wondering if you could help me with improving the homepage of my speech therapy studio. I’d really appreciate your expertise!\nLiHua: Hey! It was nice meeting you too! I’d love to help with your studio's homepage. Can you share what you have in mind or any specific changes you want? Looking forward to it!\nYurikoYamamoto: Thanks so much! I want the homepage to be more welcoming and engaging. Maybe some visuals that reflect the essence of speech therapy? Also, I’m thinking about including sections for resources and success stories. What do you think?\nLiHua: That sounds like a great approach! Visuals would definitely make it more inviting. I can help you find some nice images and layout ideas. Including resources and success stories is also a fantastic idea! Let's brainstorm some more details when we have time. Just let me know when you're available!\nYurikoYamamoto: That sounds perfect! Let’s definitely dive deeper into the details. I’m free most afternoons this week. Just tell me what works for you!\nLiHua: How about Thursday afternoon? I’m usually free after 3 PM. If that works, we can set up a time to discuss everything!\nYurikoYamamoto: Thursday after 3 PM works great for me! I’ll set aside some time so we can go through the homepage ideas together. Looking forward to it!\nLiHua: Awesome! Looking forward to our chat. Let’s make your homepage shine!",
    "content_summary": "Time: 20260223_15:00\nYurikoYamamoto: Hey Li Hua! 😊 It was great meeting you at the freelancer gather...",
    "content_length": 1484,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week8\\20260223_1500.txt",
    "metadata": {
      "id": "doc_71",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week8\\20260223_1500.txt"
    },
    "created_at": "2025-09-01T17:06:09.552225",
    "updated_at": "2025-09-01T17:06:09.592779"
  },
  "doc-bc640f326982c5dc6879e87c7f350c97": {
    "status": "processed",
    "chunks_count": 5,
    "content": "Time: 20260701_14:00\nYurikoYamamoto: Hey everyone! Just came across this study that says playing musical instruments can really boost cognitive function. It totally makes sense, right? I always feel more focused after our jam sessions! 🎶 Have you guys noticed any changes when you play?\nWolfgangSchulz: That study sounds interesting! Playing has definitely helped me unwind after a long week. Can't wait for Sunday to play again! 🎵\nWolfgangSchulz: Yeah, nothing compares to that feeling when we all come together! It really puts everything else out of my mind. \nLiHua: Totally agree! It’s like therapy for the mind, right? Plus, making music together just feels amazing! Can't wait to see what we play next! 🎸✨\nLiHua: By the way, how's everyone holding up with the garden renovation noise? I moved my work to the café to escape it! \nYurikoYamamoto: Ugh, tell me about it! It's been a bit much, right? I've been trying to block it out with music at my studio! Hope the café works out for you! \nWolfgangSchulz: Yeah, I can relate! I’ve been wearing headphones just to focus, haha. But hey, at least we’ve got our music to look forward to every Sunday! 🎶\nWolfgangSchulz: And it feels great to escape into our music! It's the perfect antidote to the chaos outside. \nChaeSong-hwa: Guess we just have to keep pushing through! I always feel refreshed after our sessions. Plus, nothing beats the chance to sing our hearts out! 🎤❤️\nWolfgangSchulz: Absolutely! Singing and playing together really lifts the spirits. Can't wait to hear what you come up with next! \nChaeSong-hwa: You know I’ll bring the energy! Let’s keep the vibe alive! 🎉 Looking forward to it!\nWolfgangSchulz: Just let me know what songs you have in mind! I’m up for anything! 🎶\nWolfgangSchulz: Also, make sure to keep the ideas flowing! It’s always fun to mix things up! \nYurikoYamamoto: For sure! I love trying out new songs together. It always brings fresh vibes to our jam sessions! Let’s keep the creativity going! 🎸✨\nLiHua: Agreed! I'm all in for new tunes! It’ll make our sessions even more exciting. Can't wait! \nChaeSong-hwa: Let’s make the next session one to remember! Bring on the new songs! 🎤✨\nChaeSong-hwa: Looking forward to jamming with you all again! Let's make some magic happen! 🎉\nYurikoYamamoto: Absolutely! I’m excited for our next session. Let’s create some unforgettable moments together! 🎵💖\nChaeSong-hwa: Can't believe how much fun we're having as a group! Playing with you all truly feels special. Let’s keep it going! 🎸💫\nWolfgangSchulz: Definitely! It's awesome being part of this band. Let's keep sharing and enjoying the music together!\nLiHua: So true! It's like our own little escape from everything else. Excited for Sunday! 🎶✨\nYurikoYamamoto: Can't wait, everyone! Music truly unites us and brings so much joy. Let's keep those good vibes coming! 🎤🎸❤️\nYurikoYamamoto: I'm always here for making memories through music with you all! Let's keep the spirit alive. 🎶🌟\nWolfgangSchulz: Looking forward to another amazing jam session! Bring on the fun!\nWolfgangSchulz: Remember to keep preparing some fresh ideas for Sunday! They always inspire us!\nLiHua: Let’s make it an unforgettable night! I can already feel the energy building up for our next jam! 🎸💥\nLiHua: Alright, everyone! Let’s keep rocking out and having a blast! Can't wait! 🎸✨\nChaeSong-hwa: Let’s keep the excitement high and make more great music together! See you all on Sunday! 🎤❤️",
    "content_summary": "Time: 20260701_14:00\nYurikoYamamoto: Hey everyone! Just came across this study that says playing mus...",
    "content_length": 3430,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week26\\20260701_1400.txt",
    "metadata": {
      "id": "doc_72",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week26\\20260701_1400.txt"
    },
    "created_at": "2025-09-01T17:06:19.383572",
    "updated_at": "2025-09-01T17:06:19.456274"
  },
  "doc-95fe961a9e9781a2acdda62cd81a560c": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260301_10:00\nLiHua: Hey Adam, just wanted to let you know that I've already transferred the rent through bank transfer. Thanks!\nAdamSmith: Thanks for the update! I appreciate it. Let me know if you need anything else.\nLiHua: Sure thing! Will do.\nAdamSmith: Glad to hear! Everything going well with settling in?\nLiHua: Yeah, it's going great! I'm really enjoying the neighborhood and exploring new places around here. How about you?\nAdamSmith: I'm doing well, thanks! Just keeping busy with work and family. If you need any tips on local spots, feel free to ask!\nLiHua: Awesome, I might take you up on that! I'm always looking for new recommendations.",
    "content_summary": "Time: 20260301_10:00\nLiHua: Hey Adam, just wanted to let you know that I've already transferred the ...",
    "content_length": 658,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week8\\20260301_1000.txt",
    "metadata": {
      "id": "doc_73",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week8\\20260301_1000.txt"
    },
    "created_at": "2025-09-01T17:06:29.465213",
    "updated_at": "2025-09-01T17:06:29.488264"
  },
  "doc-cb99145a476753364a1436403d03caf6": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260429_17:00\nAdamSmith: Hey Li Hua, just a quick reminder that the rent is due soon! Let me know if you need anything.\nLiHua: Thanks for the reminder, Adam! I’ll make sure to sort it out before the due date. Hope you’re doing well!\nAdamSmith: I’m doing well, thanks! Just busy with work as usual. If you have any questions about the basement or anything else, feel free to ask.\nLiHua: No questions at the moment, but I really appreciate the space you provided. It's been great for jamming with friends!\nAdamSmith: That’s awesome to hear! Glad the basement is useful for you. If you need any help setting things up, just let me know!\nLiHua: Will do! Looking forward to more jam sessions. Thanks again!",
    "content_summary": "Time: 20260429_17:00\nAdamSmith: Hey Li Hua, just a quick reminder that the rent is due soon! Let me ...",
    "content_length": 708,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week17\\20260429_1700.txt",
    "metadata": {
      "id": "doc_74",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week17\\20260429_1700.txt"
    },
    "created_at": "2025-09-01T17:06:39.652638",
    "updated_at": "2025-09-01T17:06:39.679378"
  },
  "doc-5a379ef69f32bb9b9954312ce5e75507": {
    "status": "processed",
    "chunks_count": 1,
    "content": "Time: 20260427_15:00\nHaileyJohnson: Hey Li Hua! Just a reminder that our 20% off bread promo has started again! 🎉 You can swing by on the 30th to grab some goodies at a discount. Can't wait to see you! 😊\nLiHua: Thanks for the reminder! I’ll definitely come by on the 30th to get some bread. Looking forward to it! 🍞✨\nHaileyJohnson: Awesome! Let me know if you need anything else before then. Happy to help! 🥖💖\nLiHua: Will do! Maybe I’ll try something new this time. See you soon! 🎉🍞\nHaileyJohnson: That's the spirit! Trying new things is always fun. Can't wait to see what you pick out! 😊🌟",
    "content_summary": "Time: 20260427_15:00\nHaileyJohnson: Hey Li Hua! Just a reminder that our 20% off bread promo has sta...",
    "content_length": 589,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week17\\20260427_1500.txt",
    "metadata": {
      "id": "doc_75",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week17\\20260427_1500.txt"
    },
    "created_at": "2025-09-01T17:06:49.910828",
    "updated_at": "2025-09-01T17:06:49.935407"
  },
  "doc-a474c37b75495a456e5de31b657c1446": {
    "status": "processed",
    "chunks_count": 14,
    "content": "Time: 20260901_13:00\nThaneChambers: Hey guys! I've got a curious question: What do you guys think Dutch van der Linde truly is in the game? \nLiHua: Yeah, Dutch van der Linde is such a complicated character, right? He’s got this charm but also shows a darker side as the story unfolds. What do you think drives his actions? Is it the idealism or just desperation?\nAisling: I find Dutch's transformation really interesting. At first, he seems so charismatic and driven by this noble cause for freedom. But then, it feels like his grip on reality starts to slip. It’s almost tragic to see him go from a leader with vision to someone who just becomes consumed by power and paranoia. What do you guys think about his relationships with the gang members? \nIleana: Totally agree with you! His relationships are so telling. I feel like he really struggles to balance being a leader with his personal emotions. Take Arthur, for example. There’s this father-son vibe, but also a lot of manipulation. It’s like he genuinely cares but also uses people to get what he wants. What do you think about that shift in his attitude towards Arthur as the story progresses?\nHelios: Yeah, that shift is pivotal! In the beginning, Dutch sees Arthur as one of his closest allies. But as Arthur starts to question Dutch's decisions and loyalty to the gang, you really see Dutch’s frustration rise. It’s almost like he can’t handle anyone doubting him, especially someone he once cared about. Their relationship feels like a roller coaster, with those moments of deep connection turning into tension. Does anyone think Dutch had to fall for the gang to truly reflect the darker sides of his character?\nIleana: Definitely! I think Dutch’s downfall highlights how isolation and pressure can warp a person's values. He starts off as this man who wanted to build a better life, but once things get tough, he resorts to dangerous methods to maintain control. It's kind of sad to see his idealism fade away. Do you all think he ever truly understood the consequences of his actions, or was he just blinded by his own vision?\nBronwyn: The way he justifies his actions is wild! It seems like he never really accepted the full weight of the choices he made. Every time things go wrong, instead of reflecting, he just doubles down on his plans. It feels like he was so caught up in his own narrative that the reality of the gang’s struggles didn't fully hit him. Do you think he genuinely believed he was doing the right thing for his gang?\nAisling: I think he tries to convince himself of that! Dutch has a way of spinning his actions to fit his narrative. It’s like he feels he’s doing everything for the “greater good,” but he also becomes more selfish as time passes. By the end, it feels like he’s lost that connection to his original ideals completely. What’s really striking is how that impacts the trust within the gang. Did you guys notice how his decisions started to isolate him from the rest?\nGavriel: Yeah, for sure! The more he strayed from his original path, the more everyone began to question him. It's like he created this bubble where he was the only one with the “vision.” Even the most loyal members started to see the cracks in his leadership. I found it heartbreaking when characters like Arthur desperately tried to pull him back, but Dutch was too far gone. It’s interesting to think about how much leadership is about trust and integrity, right?\nGavriel: Exactly! That trust is everything in a gang like theirs. When Dutch started making those reckless decisions, it eroded the foundation of their community. It’s like he became this dictator rather than a leader, and that pushed everyone away. In a way, it makes you question what it means to lead effectively. Do you think there was a turning point for him or was it a gradual decline?\nAisling: I feel like it was definitely a gradual decline, but there were key moments that really highlighted it. For instance, when he makes that risky decision during the bank heist and everything goes sideways, it’s like the turning point for the gang’s trust in him. You could see Arthur and some others beginning to doubt him then. It’s almost like the pressure of the world outside forced him to make choices that aligned with his growing paranoia. Do you think he could have turned things around if he had listened to Arthur and others sooner?\nIleana: Ileana: I really think so! If he’d been open to feedback and took some responsibility, things could have gone differently. His inability to adapt and listen to his closest allies ultimately led to his downfall. It’s such a tragic arc – he could’ve kept the gang together. Makes you wonder how many leaders fall into the same trap, you know?\nElara: Totally! It’s fascinating how power can blind even the most well-intentioned people. Dutch’s downfall serves as a cautionary tale. You can have the best intentions, but if you shut yourself off from feedback, it’s basically a recipe for disaster. It’s a shame; the gang had a chance at a better future if only he had been more flexible. Do you think we’ll ever see a character like Dutch again in games?\nGavriel: I think characters like Dutch will always resonate because they embody such complex traits. Games often explore moral ambiguity, and that means we'll likely see more characters who struggle with ideals vs. reality. It's such rich storytelling! Plus, players enjoy those emotional roller coasters. I'm curious if any new games this year will tackle similar themes. Any thoughts on upcoming releases that might dive into complex character arcs?\nDyllan: I haven’t been following the upcoming releases closely, but I heard some buzz around a few RPGs that aim to explore deep character relationships and moral struggles. They might have characters that mirror the complexity of Dutch. It’ll be interesting to see how they develop those arcs and what kind of choices players will have to influence the story. Any specific titles that caught anyone’s attention?\nDyllan: I’ve seen some previews for a new open-world game that seems to focus on choice and consequence, especially around leadership roles. It looks like it’ll dive into how your decisions shape your group dynamics, similar to Red Dead. If they do it well, we could see another complex character like Dutch emerge! You guys keeping an eye on any specific games? \nLiHua: I'm definitely watching for updates on those titles! I love how games are evolving to include deeper narratives with complex characters. It just makes the experience so much richer. Speaking of narratives, has anyone tried playing games that focus on deep storytelling and relationships, like \"The Last of Us\"? It really makes you think about those character dynamics!\nIleana: Ileana: \"The Last of Us\" is such a masterpiece! The character growth and moral dilemmas are top-notch. Joel and Ellie’s relationship is such a roller coaster – you can feel the love, but also the tension and sacrifices they make. It really showcases how complicated human connections can be in extreme situations. Can't wait to see how future games tackle similar themes!\nThaneChambers: So true! \"The Last of Us\" does such an amazing job of showing how relationships evolve under stress. That combination of love, loss, and difficult choices really gets to you! I think as games like that evolve, they’re gonna push boundaries even further. It would be cool to see more characters who struggle with similar challenges as Dutch, but with the chance for redemption or growth. What are your thoughts on characters who stay stuck in their ways vs. those who learn and adapt?\nCaelum: Definitely, seeing character growth can make a story feel way more fulfilling! Characters who learn from their mistakes resonate more with us because they feel real. It's like watching them evolve gives us hope for change in our own lives too. On the flip side, characters who refuse to adapt can serve as a cautionary tale. They remind us of the consequences of being rigid and ignoring the growth opportunities in life. Do you think it would make a difference if Dutch had had even one character to genuinely connect with in the later stages?\nFionnuala: It would have made such a difference! If Dutch had someone to ground him or challenge him positively, maybe he wouldn’t have spiraled so far. Connection can really change perspectives, especially in tough times. A mentor or even just a close friend to give him honest feedback could’ve been a game changer. It's heartbreaking to think how lonely and isolated he became, leading to his downfall. What specific relationship in the game do you think had the most potential to provide that for him?\nGavriel: I think the bond between him and Arthur had a lot of potential! They had a deep history together, and there were moments when Arthur genuinely cared about Dutch's vision. If Dutch had trusted Arthur enough to open up, he might have gotten the support he needed to reconsider his choices. It's tragic because there were glimpses of that father-son dynamic, but ultimately, pride got in the way. Do you think that if Dutch had listened to Arthur, he could’ve avoided his tragic fate?\nDyllan: Absolutely! I think if Dutch had let go of his pride and really listened to Arthur's concerns, it could've changed everything. Arthur often saw things more clearly, especially as events unfolded. Their bond was strong enough that if Dutch hadn't pushed him away, Arthur might have provided the balance he desperately needed. It's a shame to see how power and paranoia fractured that relationship. What do you all think about the importance of that kind of communication in leadership?\nHelios: Communication in leadership is huge! A leader needs to be open and willing to listen, especially in high-stress situations. When leaders isolate themselves or surround themselves with yes-men, they miss out on crucial perspectives. In Dutch’s case, his inability to communicate and adapt led to not just his downfall but the disintegration of the entire gang. It serves as a reminder that fostering open dialogue can prevent conflicts and misunderstandings. Do you think we’re seeing this more in modern storytelling in games lately?\nIleana: YES! Modern games are definitely leaning into more nuanced storytelling and character interactions. We're seeing more plots that emphasize the importance of communication and collaboration. It really reflects real-life dynamics, and players can relate to those struggles. Games like \"Life is Strange\" and even some RPGs shine in giving players choices that affect relationships and outcomes. It feels like game developers are becoming more attuned to what makes storytelling impactful. Do you think that trend will continue?\nHelios: I sure hope so! As players, we crave those emotional connections and realistic choices that shape characters' journeys. The more that games evolve to include these dynamics, the richer the experience becomes. It's really exciting to think about how future narratives will reflect our complex realities, including flawed characters like Dutch. If they keep pushing boundaries, who knows what amazing stories we’ll see next!\nElara: For sure! That evolution in storytelling is so needed. Games that challenge us emotionally and make us think about relationships and choices are going to resonate more in the future. I'm all in for those deep narratives! Can't wait to see what they come up with next. It’s a great time to be a gamer!\nElara: I'm so glad we're diving into these discussions! It's really interesting to see how character complexity unfolds in gaming. I can't wait to see how new titles handle these themes! Do you guys have any last thoughts to wrap up this convo?\nIleana: Ileana: I just hope that the trend of deep storytelling and character exploration continues to grow! It leads to more memorable gaming experiences. Here's to more characters that challenge us and make us think! Can't wait to see what's next. \nBronwyn: Totally agree! Exploring these complex characters just enriches the gaming experience. Excited for what the future holds for storytelling in games!\nBronwyn: I'm looking forward to more discussions like this! Talking about these characters really opens up new perspectives on gaming. Let's keep an eye on the upcoming releases!\nCaelum: Absolutely! Can't wait for our next chat about games. It’s always great sharing thoughts with you all. Let’s keep this convo going in the future!\nGavriel: Definitely! It's awesome to have these discussions with everyone. Looking forward to our next chat about characters and games! Let's keep exploring!\nAisling: For sure! I love how these discussions open up new insights. Can't wait to see what games will come out next for us to analyze! Let's keep the convo going!\nFionnuala: Looking forward to it! Always fun to dive deep into game characters with everyone. See you all next time!\nHelios: Catch you all later! Let’s continue the fun discussions next time! 🎮\nBronwyn: See you all! Excited for our next gaming chat! 🎮",
    "content_summary": "Time: 20260901_13:00\nThaneChambers: Hey guys! I've got a curious question: What do you guys think Du...",
    "content_length": 13040,
    "file_path": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week35\\20260901_1300.txt",
    "metadata": {
      "id": "doc_76",
      "source": "C:\\Users\\Francisco Azeredo\\OneDrive\\Documents\\tecnico\\5 ano\\tese\\Código\\MiniRAG\\dataset\\LiHua-World\\data\\LiHuaWorld\\LiHua-World\\week35\\20260901_1300.txt"
    },
    "created_at": "2025-09-01T17:07:00.540647",
    "updated_at": "2025-09-01T17:07:00.783909"
  }
}